Repository: CrazyForks/Sequel-Ace
Catalog: Resources/Localization/*.lproj/Localizable.strings
Languages: fr

source: Enter connection details below, or choose a favorite
fr: Entrez les informations de connexion ci-dessous, ou choisissez un favori

source: Enter your password for the SSH key "%@"
fr: Entrez votre mot de passe pour la clé SSH '%@

source: Entire Content
fr: Tout le contenu

source: Error
fr: Erreur

source: Error adding field
fr: Erreur lors de l'ajout du champ

source: Error adding new column
fr: Erreur lors de l'ajout d'une nouvelle colonne

source: Error adding new table
fr: Erreur lors de l'ajout d'une nouvelle table

source: Error adding password to Keychain
fr: Erreur lors de l'ajout du mot de passe au trousseau

source: Error changing field
fr: Erreur lors du changement de champ

source: Error changing table collation
fr: Erreur lors du changement du collationnement de la table

source: Error changing table comment
fr: Erreur lors du changement du commentaire de la table

source: Error changing table encoding
fr: Erreur lors du changement de l'encodage de la table

source: Error changing table type
fr: Erreur lors du changement du type de table

source: Error creating relation
fr: Erreur de création de la relation

source: Error creating trigger
fr: Erreur lors de la création du déclencheur

source: Error for
fr: Erreur pour

source: Error for “%1$@”: %2$@
fr: Erreur pour «%1$@» : %2$@

source: Error moving field
fr: Erreur lors du déplacement du champ

source: error occurred
fr: une erreur s'est produite

source: Error reading import file.
fr: Erreur lors de la lecture du fichier d'importation.

source: Error retrieving Keychain item to edit
fr: Erreur lors de la récupération de l'élément Trousseau à modifier

source: Error retrieving table information
fr: Erreur lors de la récupération des informations de la table

source: Error retrieving trigger information
fr: Erreur lors de la récupération des informations du déclencheur

source: Error truncating table
fr: Erreur lors du tronquage de la table

source: Error updating Keychain item
fr: Erreur lors de la mise à jour de l'élément Trousseau

source: Error while analyzing selected items
fr: Erreur lors de l'analyse des éléments sélectionnés

source: Error while checking selected items
fr: Erreur lors de la vérification des éléments sélectionnés

source: Error while converting color scheme data
fr: Erreur lors de la conversion des données du schéma de couleurs

source: Error while converting connection data
fr: Erreur lors de la conversion des données de connexion

source: Error while converting content filter data
fr: Erreur lors de la conversion des données du filtre de contenu

source: Error while converting query favorite data
fr: Erreur lors de la conversion des données favoris de la requête

source: Error while converting session data
fr: Erreur lors de la conversion des données de session

source: Error while deleting field
fr: Erreur lors de la suppression du champ

source: Error while duplicating Bundle content.
fr: Erreur lors de la duplication du contenu du paquet.

source: Error while executing JavaScript BASH command
fr: Erreur lors de l'exécution de la commande JavaScript BASH

source: Error while fetching the optimized field type
fr: Erreur lors de la récupération du type de champ optimisé

source: Error while flushing selected items
fr: Erreur lors du vidage des éléments sélectionnés

source: Error while importing table
fr: Erreur lors de l'importation de la table

source: Error while installing Bundle
fr: Erreur lors de l'installation du bundle

source: Error while installing color theme file
fr: Erreur lors de l'installation du fichier de thème de couleur

source: Error while moving %@ to Trash.
fr: Erreur lors du déplacement de %@ vers la corbeille.

source: Error while optimizing selected items
fr: Erreur lors de l'optimisation des éléments sélectionnés

source: Error while parsing CREATE TABLE syntax
fr: Erreur lors de l'analyse de la syntaxe CREATE TABLE

source: Error while reading connection data file
fr: Erreur lors de la lecture du fichier de données de connexion

source: Error while reading data file
fr: Erreur lors de la lecture du fichier de données

source: Error while repairing selected items
fr: Erreur lors de la réparation des éléments sélectionnés

source: Error while saving the Bundle.
fr: Erreur lors de l'enregistrement du bundle.

source: Error while saving %@.
fr: Erreur lors de la sauvegarde de %@.

source: Errors
fr: Erreurs

source: Example:
fr: Exemple:

source: exclude BLOB
fr: exclure le BLOB

source: Execution Privilege
fr: Privilège d'Exécution

source: execution privilege: %@
fr: privilège d'exécution : %@

source: Execution stopped!
fr: Exécution arrêtée !

source: Export Selected...
fr: Exporter la sélection ...

source: Exporting %@
fr: Exportation de %@

source: Exporting Dot File
fr: Exportation du fichier point

source: Exporting SQL
fr: Exportation du SQL

source: Extra
fr: Supplément

source: Failed to remove index '%@'
fr: Impossible de supprimer l'index '%@'

source: Fatal Error
fr: Erreur fatale

source: Favorite
fr: Favoris

source: Favorites
fr: Favoris

source: Favorites export error
fr: Erreur d'exportation des Favoris

source: Favorites import error
fr: Erreur d'importation des Favoris

source: Fetching data...
fr: Récupération des données...

source: fetching database structure data in progress
fr: récupération des données de la structure de la base de données en cours

source: fetching database structure in progress
fr: récupération de la structure de la base de données en cours

source: fetching table data…
fr: récupération des données de la table…

source: field
fr: champ

source: Field
fr: Champ

source: Field is not editable. Couldn't identify field origin unambiguously (%ld matches).
fr: Le champ n'est pas éditable. Impossible d'identifier l'origine du champ sans ambiguïté (%ld correspondances).

source: Field is not editable. Field has no or multiple table or database origin(s).
fr: Le champ n'est pas modifiable. Le champ n'a pas de table ou origine de base de données multiple.

source: Field is not editable. No matching record found. Reload data, check encoding, or try to add a primary key field or more fields in your SELECT statement for table '%@' to identify field origin unambiguously.
fr: Le champ n'est pas modifiable. Aucun enregistrement correspondant trouvé. Recharger les données, vérifier l'encodage, ou essayez d'ajouter un champ clé primaire ou plus de champs dans votre instruction SELECT pour la table '%@' pour identifier sans ambiguïté l'origine du champ.

source: Field is not editable. No matching record found. Reload table, check the encoding, or try to add a primary key field or more fields in the view declaration of '%@' to identify field origin unambiguously.
fr: Le champ n'est pas modifiable. Aucun enregistrement correspondant trouvé. Recharger la table, vérifier l'encodage, ou essayez d'ajouter un champ clé primaire ou plus de champs dans la déclaration de vue de '%@' pour identifier sans ambiguïté l'origine du champ .

source: File couldn't be read.
fr: Le fichier n'a pas pu être lu.

source: File couldn't be read: %@ It will be deleted.
fr: Le fichier n'a pas pu être lu: %@ Il sera supprimé.

source: File read error
fr: Erreur de lecture du fichier

source: Files with the same names already exist in the target folder. Replacing them will overwrite their current contents.
fr: Des fichiers portant le même nom existent déjà dans le dossier cible. Les remplacer écrasera leur contenu actuel.

source: Filter
fr: Filtre

source: Apply Filter(s)
fr: Appliquer le(s) filtre(s)

source: Filter Tables
fr: Filtrer les tables

source: Filtered table content
fr: Contenu de la table filtrée

source: Filtering failed. Please try again.
fr: Le filtrage a échoué. Veuillez réessayer.

source: Filtering table...
fr: Filtrage de la table...

source: Finished exporting to %@
fr: Exportation vers %@ terminée

source: Finished importing %@
fr: Import terminé %@

source: Flush %@
fr: Vider %@

source: Flush Selected Items
fr: Vider les éléments sélectionnés

source: Flush Table
fr: Vider la table

source: Flush table failed.
fr: La table de vidage a échoué.

source: Flush View
fr: Vider la vue

source: Flushed Privileges
fr: Privilèges purgés

source: For BIT fields only “1” or “0” are allowed.
fr: Pour les champs BIT seuls « 1 » ou « 0 » sont autorisés.

source: Force delete (disables integrity checks)
fr: Forcer la suppression (désactive les vérifications d'intégrité)

source: function
fr: fonction

source: FUNCTION INFORMATION
fr: INFORMATIONS DE FONCTION

source: functions
fr: fonctions

source: General
fr: Généraux

source: General Preferences
fr: Préférences Générales

source: General Scope commands will run application-wide
fr: Les commandes générales Scope exécuteront l'ensemble de l'application

source: Generating print document...
fr: Génération du document d'impression...

source: Generation Time
fr: Temps de génération

source: Global
fr: Globale

source: Globally stored favorites
fr: Favoris stockés globalement

source: Notifications are delivered via the Notification Center.
fr: Les notifications sont envoyées via le centre de notification.

source: Gzip compression
fr: Compression Gzip

source: Help topics for %@
fr: Sujets d'aide pour %@

source: Hide Console
fr: Masquer la console

source: Hide Tab Bar
fr: Masquer la barre d'onglets

source: Hide Toolbar
fr: Cacher la barre d'outils

source: Host
fr: Hôte

source: IEEE 754 double-precision floating-point value. M is the maxium number of digits, of which D may be after the decimal point. Note: Many decimal numbers can only be approximated by floating-point values. See DECIMAL if you require exact results.
fr: Valeur à virgule flottante IEEE 754. M est le nombre maximal de chiffres, dont D peut être après la virgule. Note: De nombreux nombres décimaux ne peuvent être approchés que par des valeurs à virgule flottante. Voir DECIMAL si vous avez besoin de résultats exacts.

source: IEEE 754 single-precision floating-point value. M is the maxium number of digits, of which D may be after the decimal point. Note: Many decimal numbers can only be approximated by floating-point values. See DECIMAL if you require exact results.
fr: La valeur à virgule flottante IEEE 754 mono-précision. M est le nombre maximal de chiffres, dont D peut être après la virgule. Note: De nombreux nombres décimaux ne peuvent être approchés que par des valeurs à virgule flottante. Voir DECIMAL si vous avez besoin de résultats exacts.

source: Ignore
fr: Ignorer

source: Ignore All Errors
fr: Ignorer toutes les erreurs

source: Ignore all Fields
fr: Ignorer tous les champs

source: Ignore field
fr: Ignorer le champ

source: Ignore Field
fr: Ignorer le champ

source: Import
fr: Importation

source: Import all Fields
fr: Importer tous les champs

source: Import Anyway
fr: Importer quand même

source: Import cancelled!
fr: Importation annulée!

source: Import Error
fr: Erreur d'importation

source: Import field
fr: Champ d'import

source: Import file does not exist.
fr: Le fichier d'importation n'existe pas.

source: Import of the selected data is currently not supported.
fr: L'importation des données sélectionnées n'est actuellement pas prise en charge.

source: Imported %@ of %@
fr: Importé %1$@ de %2$@

source: Imported %@ of CSV data
fr: %@ de données CSV importées

source: Imported %@ of SQL
fr: Importé %@ de SQL

source: Importing CSV
fr: Importation de CSV

source: Importing SQL
fr: Importation du SQL

source: include BLOB
fr: inclure BLOB

source: Include content
fr: Inclure le contenu

source: Incompatible encoding in SQL file
fr: Encodage incompatible dans le fichier SQL

source: INFORMATION
fr: INFORMATIONS

source: Inherit from database (%@)
fr: Hériter de la base de données (%@)

source: Initializing...
fr: Initialisation en cours...

source: Input Field
fr: Champ de saisie

source: Input Field doesn't support insertion of snippets.
fr: Le champ d'entrée ne supporte pas l'insertion de snippets.

source: Input Field is not editable.
fr: Le champ de saisie n'est pas modifiable.

source: Input Field Scope commands will run on each text input field
fr: Les commandes de champ de saisie seront exécutées sur chaque champ de saisie de texte

source: Insert as Snippet
fr: Insérer en tant que snippet

source: Insert as Text
fr: Insérer en tant que texte

source: Installed Bundles
fr: Bundles installés

source: Installing Bundle
fr: Installation du bundle

source: Insufficient connection details
fr: Pas assez de détails de connexion

source: Insufficient details provided to establish a connection. Please enter at least the hostname.
fr: Pas assez de détails fournis pour établir une connexion. Veuillez saisir au moins le nom d'hôte.

source: Insufficient details provided to establish a connection. Please enter the hostname for the SSH Tunnel, or disable the SSH Tunnel.
fr: Informations insuffisantes fournies pour établir une connexion. Veuillez entrer le nom d'hôte du tunnel SSH, ou désactiver le tunnel SSH.

source: Insufficient details provided to establish a connection. Please provide at least a host.
fr: Informations insuffisantes pour établir une connexion. Veuillez fournir au moins un hôte.

source: Interpret data as:
fr: Interpréter les données comme :

source: Invalid database
fr: Base de données invalide

source: Invalid file supplied!
fr: Fichier fourni invalide !

source: Invalid hexadecimal value
fr: Valeur hexadécimale invalide

source: Is Deterministic
fr: Est déterministe

source: Is Nullable
fr: Est nullable

source: is updatable: %@
fr: est modifiable : %@

source: items
fr: Eléments

source: JavaScript Exception
fr: Exception JavaScript

source: JavaScript Parsing Error
fr: Erreur d'analyse JavaScript

source: Key
fr: Clés

source: Kill
fr: Éliminer

source: Kill connection?
fr: Tuer la connexion?

source: Kill query?
fr: Tuer la requête?

source: Last Error Message
fr: Dernier message d'erreur

source: Last Used
fr: Dernière utilisation

source: Limited to @@max_allowed_packet
fr: Limité à @@max_allowed_packet

source: Loading %@...
fr: Chargement de %@...

source: Loading database '%@'...
fr: Chargement de la base de données '%@'...

source: Loading history entry...
fr: Chargement de la saisie de l'historique...

source: Loading page %lu...
fr: Chargement de la page %lu...

source: Loading reference...
fr: Chargement de la référence...

source: Loading table data...
fr: Chargement des données du tableau...

source: Low memory
fr: Mémoire faible

source: M (precision): Up to 65 digits D (scale): 0 to 30 digits
fr: M (précision) : jusqu'à 65 chiffres D (échelle) : 0 à 30 chiffres

source: M: %@ to %@ bytes
fr: M: %1$@ à %2$@ octets

source: M: %@ to %@ characters
fr: M: Caractères %1$@ à %2$@

source: M: %@ to %@ characters (4 GiB)
fr: M: %1$@ à %2$@ caractères (4 Go)

source: M: 0 to 255 bytes
fr: M: 0 à 255 octets

source: M: 0 to 255 characters
fr: M: 0 à 255 caractères

source: M: 1 (default) to 64
fr: M: 1 (par défaut) à 64

source: Make sure the file contains a RSA private key and is using PEM encoding.
fr: Assurez-vous que le fichier contient une clé privée RSA et utilise l'encodage PEM.

source: Make sure the file contains a X.509 client certificate and is using PEM encoding.
fr: Assurez-vous que le fichier contient un certificat client X.509 et qu'il utilise l'encodage PEM.

source: Match Field
fr: Champ de correspondance

source: Maximum number of arguments is 2!
fr: Le nombre maximum d'arguments est de 2!

source: Maximum text length is set to %ld.
fr: La longueur maximale du texte est définie à %ld.

source: Maximum text length is set to %ld. Inserted text was truncated.
fr: La longueur maximale du texte est définie à %ld. Le texte ajouté a été tronqué.

source: Maximum text length is set to %llu.
fr: La longueur maximale du texte est définie à %llu.

source: Maximum text length is set to %llu. Inserted text was truncated.
fr: La longueur maximale du texte est définie à %llu. Le texte ajouté a été tronqué.

source: MGTemplateEngine Error
fr: Erreur MGTemplateEngine

source: Month
fr: Mois

source: multiple selection
fr: sélection multiple

source: MySQL connecting...
fr: Connexion à MySQL...

source: MySQL Help for Selection
fr: Aide MySQL pour la sélection

source: MySQL Help for Word
fr: Aide MySQL pour Word

source: MySQL Help – Categories
fr: Aide MySQL – Catégories

source: MySQL said:
fr: MySQL a dit:

source: MySQL said: %@
fr: MySQL a dit: %@

source: MySQL said: %@
fr: MySQL a dit: %@

source: MyTheme
fr: Mon thème

source: Network
fr: Réseau

source: Network Preferences
fr: Préférences réseau

source: Files
fr: Fichiers

source: File Preferences
fr: Préférences du fichier

source: New Bundle
fr: Nouveau pack

source: New Column Name
fr: Nom de la nouvelle colonne

source: New Favorite
fr: Nouveau favori

source: New Filter
fr: Nouveau filtre

source: New Folder
fr: Nouveau dossier

source: New Name
fr: Nouveau nom

source: New Table
fr: Nouvelle table

source: No color theme data found.
fr: Aucune donnée de thème de couleur trouvée.

source: no compression
fr: pas de compression

source: No connection available
fr: Aucune connexion disponible

source: No connection data found.
fr: Aucune donnée de connexion trouvée.

source: No content filters found.
fr: Aucun filtre de contenu trouvé.

source: No data found.
fr: Aucune donnée trouvée.

source: No errors
fr: Aucune erreur

source: No Favorties
fr: Aucun favori

source: No files could be created
fr: Aucun fichier n'a pu être créé

source: No item found
fr: Aucun élément trouvé

source: No local port could be allocated for the SSH Tunnel.
fr: Aucun port local n'a pu être alloué pour le tunnel SSH.

source: NO MATCHES
fr: AUCUN MATCH

source: No optimized field type found.
fr: Aucun type de champ optimisé trouvé.

source: No query favorites found.
fr: Aucun favori de requête trouvé.

source: No results found.
fr: Aucun résultat trouvé.

source: None
fr: Aucun

source: Not available
fr: Indisponible

source: Number of arguments: %lu
fr: Nombre d'arguments : %lu

source: One additional row was removed!
fr: Une ligne supplémentaire a été supprimée!

source: One row was not removed.
fr: Une ligne n'a pas été supprimée.

source: Only one dragged item allowed.
fr: Un seul élément déplacé est autorisé.

source: Only Partially Supported
fr: Partiellement pris en charge

source: Open Function in New Tab
fr: Ouvrir la fonction dans un nouvel onglet

source: Open Function in New Window
fr: Ouvrir la fonction dans une nouvelle fenêtre

source: Open in New Tab
fr: Ouvrir dans un nouvel onglet

source: Open in New Window
fr: Ouvrir dans une nouvelle fenêtre

source: Open Procedure in New Tab
fr: Ouvrir la procédure dans un nouvel onglet

source: Open Procedure in New Window
fr: Ouvrir la procédure dans une nouvelle fenêtre

source: Open Table in New Tab
fr: Ouvrir la table dans un nouvel onglet

source: Open Table in New Window
fr: Ouvrir la table dans une nouvelle fenêtre

source: Open View in New Tab
fr: Ouvrir la vue dans un nouvel onglet

source: Open View in New Window
fr: Ouvrir la vue dans une nouvelle fenêtre

source: Open %@ in New Window
fr: Ouvrir %@ dans une nouvelle fenêtre

source: Optimize %@
fr: Optimiser %@

source: Optimize Selected Items
fr: Optimiser les éléments sélectionnés

source: Optimize Table
fr: Optimiser la table

source: Optimize table failed.
fr: L'optimisation de la table a échoué.

source: Optimized type for field '%@'
fr: Type optimisé pour le champ '%@'

source: optional
fr: optionnel

source: Passed parameter couldn't be interpreted. Only string or array (with 2 elements) are allowed.
fr: Le paramètre passé n'a pas pu être interprété. Seule une chaîne ou un tableau (avec 2 éléments) sont autorisés.

source: Permission Denied
fr: Autorisation refusée

source: Please choose a favorite
fr: Veuillez choisir un favori

source: Please enter the hostname for the SSH Tunnel, or disable the SSH Tunnel.
fr: Veuillez entrer le nom d'hôte du tunnel SSH, ou désactiver le tunnel SSH.

source: Please enter the password for ‘%@’:
fr: Veuillez entrer le mot de passe pour ‘%@’:

source: Print
fr: Imprimer

source: Print Page…
fr: Imprimer la page…

source: Privileges
fr: Privilèges

source: procedure
fr: Acte

source: PROCEDURE INFORMATION
fr: INFORMATIONS DU PROCEDURE

source: procedures
fr: Actes

source: Proceed
fr: Procéder

source: Query
fr: Requête

source: Query Background
fr: Fond de la requête

source: Query cancelled.
fr: Requête annulée.

source: Query cancelled. Please note that to cancel the query the connection had to be reset; transactions and connection variables were reset.
fr: Requête annulée. Veuillez noter que pour annuler la requête, la connexion a dû être réinitialisée; les transactions et les variables de connexion ont été réinitialisées.

source: Query Editor
fr: Éditeur de requête

source: Query Editor Preferences
fr: Préférences de l'éditeur de requête

source: Query logging is currently disabled
fr: L'enregistrement des requêtes est actuellement désactivé

source: Query Result
fr: Résultat de la requête

source: Query results
fr: Résultats de la requête

source: Query Status
fr: Statut de la requête

source: Querying row count failed
fr: La requête du nombre de lignes a échoué

source: Quick Connect
fr: Connexion Rapide

source: Quote
fr: Devis

source: Renaming the database '%@' is currently unsupported as it contains objects other than tables (i.e. views, procedures, functions, etc.). If you would like to rename a database please use the 'Duplicate Database', move any non-table objects manually then drop the old database.
fr: Le renommage de la base de données '%@' n'est actuellement pas pris en charge car elle contient des objets autres que les tables (ex: vues, procédures, fonctions, etc.). Si vous souhaitez renommer une base de données, veuillez utiliser la 'Dupliquer la base de données', déplacer tous les objets qui ne sont pas des tables manuellement, puis supprimer l'ancienne base de données.

source: Range: %@ to %@
fr: Plage : %1$@ à %2$@

source: Range: -838:59:59.0 to 838:59:59.0 F (precision): 0 (1s) to 6 (1µs)
fr: Intervalle : -838:59:59.0 à 838:59:59.0 F (précision) : 0 (1s) à 6 (1μs)

source: Range: 0000, 1901 to 2155
fr: Plage : 0000, 1901 à 2155

source: Range: 1 to 64 members 1, 2, 3, 4 or 8 bytes storage
fr: Plage de stockage : 1 à 64 membres 1, 2, 3, 4 ou 8 octets

source: Range: 1000-01-01 00:00:00.0 to 9999-12-31 23:59:59.999999 F (precision): 0 (1s) to 6 (1µs)
fr: Portée : 1000-01-01 00:00:00.0 à 9999-12-31 23:59:59.999999 F (précision): 0 (1s) à 6 (1μs)

source: Range: 1000-01-01 to 9999-12-31
fr: Plage : 1000-01-01 à 9999-12-31

source: Range: 1970-01-01 00:00:01.0 to 2038-01-19 03:14:07.999999 F (precision): 0 (1s) to 6 (1µs)
fr: Portée : 1970-01-01 00:00:01.0 à 2038-01-19 03:14:07.9999 F (précision) : 0 (1s) à 6 (1μs)

source: Reading...
fr: Lecture...

source: Refresh Databases
fr: Rafraîchir les bases de données

source: Refresh List
fr: Rafraîchir la liste

source: Relations
fr: Relations avec le client

source: Relations for table: %@
fr: Relations pour la table: %@

source: Reload Bundles
fr: Recharger les packs

source: Reloading data...
fr: Rechargement des données...

source: Remote Error
fr: Erreur distante

source: Remove
fr: Retirer

source: Remove All
fr: Retirer tout

source: Remove all query favorites?
fr: Supprimer tous les favoris de la requête ?

source: Remove selected Bundle?
fr: Supprimer le lot sélectionné ?

source: Remove selected content filters?
fr: Supprimer les filtres de contenu sélectionnés ?

source: Remove selected query favorites?
fr: Supprimer les favoris de la requête sélectionnée ?

source: Removing field...
fr: Suppression du champ...

source: Removing index...
fr: Suppression de l'index...

source: Rename database '%@' to:
fr: Renommer la base de données '%@' en :
