Repository: CrazyForks/Sequel-Ace
Catalog: Resources/Localization/*.lproj/Localizable.strings
Languages: fr

source: Rename Function...
fr: Renommer la fonction...

source: Rename Procedure...
fr: Renommer la procédure...

source: Rename Table...
fr: Renommer la table...

source: Rename View...
fr: Renommer la vue...

source: Repair %@
fr: Réparer %@

source: Repair Selected Items
fr: Réparer les éléments sélectionnés

source: Repair Table
fr: Table de réparation

source: Repair table failed.
fr: La réparation de la table a échoué.

source: Replace
fr: Remplacer

source: Replace Entire Content
fr: Remplacer tout le contenu

source: Replace Selection
fr: Remplacer la sélection

source: Represents a 4 digit year value, stored as 1 byte. Invalid values are converted to 0000 and two digit values 0 to 69 will be converted to years 2000 to 2069, resp. values 70 to 99 to years 1970 to 1999. The YEAR(2) type was removed in MySQL 5.7.5.
fr: Représente une valeur d'année de 4 chiffres, stockée en 1 octet. Les valeurs invalides sont converties en 0000 et les valeurs de deux chiffres de 0 à 69 seront converties en années 2000 à 2069, resp. valeurs 70 à 99 années 1970 à 1999. Le type YEAR(2) a été supprimé dans MySQL 5.7.5.

source: Represents a collection of LineStrings.
fr: Représente une collection de LineStrings.

source: Represents a collection of objects of any other single- or multi-valued spatial type. The only restriction being, that all objects must share a common coordinate system.
fr: Représente une collection d'objets de tout autre type spatial à valeur unique ou à valeur multiples. La seule restriction est que tous les objets doivent partager un système commun de coordonnées.

source: Represents a collection of Polygons. The Polygons making up the MultiPolygon must not intersect.
fr: Représente une collection de Polygons. Les polygones qui composent le multipolygone ne doivent pas se croiser.

source: Represents a set of Points without specifying any kind of relation and/or order between them.
fr: Représente un ensemble de Points sans spécifier de relation et/ou d'ordre entre eux.

source: Represents a single location in coordinate space using X and Y coordinates. The point is zero-dimensional.
fr: Représente un seul emplacement dans l'espace de coordonnées en utilisant les coordonnées X et Y. Le point est de dimension zéro.

source: Represents an ordered set of coordinates where each consecutive pair of two points is connected by a straight line.
fr: Représente un ensemble ordonné de coordonnées où chaque paire consécutive de deux points est connectée par une ligne droite.

source: required
fr: Obligatoire

source: Requires 2 bytes storage space. M is the optional display width and does not affect the possible value range.
fr: Nécessite 2 octets d'espace de stockage. M est la largeur d'affichage optionnelle et n'affecte pas la plage de valeurs possible.

source: Requires 3 bytes storage space. M is the optional display width and does not affect the possible value range.
fr: Nécessite 3 octets d'espace de stockage. M est la largeur d'affichage optionnelle et n'affecte pas la plage de valeurs possible.

source: Requires 4 bytes storage space. M is the optional display width and does not affect the possible value range. INTEGER is an alias to this type.
fr: Nécessite 4 octets d'espace de stockage. M est la largeur d'affichage optionnelle et n'affecte pas la plage de valeurs possible. INTEGER est un alias de ce type.

source: Requires 8 bytes storage space. M is the optional display width and does not affect the possible value range. Note: Arithmetic operations might fail for large numbers.
fr: Nécessite 8 octets d'espace de stockage. M est la largeur d'affichage optionnelle et n'affecte pas la plage de valeurs possible. Note : Les opérations Arithmetic peuvent échouer pour de grands nombres.

source: Reset AUTO_INCREMENT after deletion (only for Delete ALL ROWS IN TABLE)?
fr: Réinitialiser AUTO_INCREMENT après la suppression (uniquement pour supprimer TOUTES LES ROUILLES DANS LA TABLE) ?

source: Delete Selected Row
fr: Supprimer la ligne sélectionnée

source: Delete Selected Rows
fr: Supprimer les lignes sélectionnées

source: Delete ALL ROWS IN TABLE
fr: Supprimer toutes les ROWS dans la TABLE

source: Restoring session...
fr: Restauration de la session...

source: Return Type
fr: Type de retour

source: return type: %@
fr: type de retour : %@

source: row
fr: ligne

source: rows
fr: lignes

source: Rows %@ - %@ from filtered matches
fr: Lignes %1$@ - %2$@ des correspondances filtrées

source: Rows %@ - %@ of %@%@ from table
fr: Lignes %1$@ - %2$@ de %3$@%4$@ depuis la table

source: rows: %@
fr: lignes : %@

source: rows: ~%@
fr: lignes: ~%@

source: Run All
fr: Exécuter tout

source: Run All Queries
fr: Exécuter toutes les requêtes

source: Run Current
fr: Exécuter le courant

source: Run Current Query
fr: Exécuter la requête actuelle

source: Run Custom Query
fr: Exécuter une requête personnalisée

source: Run Previous
fr: Exécuter Précédent

source: Run Previous Query
fr: Exécuter la requête précédente

source: Run Selected Text
fr: Exécuter le texte sélectionné

source: Run Selection
fr: Exécuter la sélection

source: Running query %i of %lu...
fr: Exécution de la requête %1$i de %2$lu...

source: Running query %ld of %lu...
fr: Exécution de la requête %1$ld de %2$lu...

source: Running query...
fr: Requête en cours...

source: Save
fr: Enregistrer

source: Save All to Favorites
fr: Tout enregistrer dans les favoris

source: Save As...
fr: Enregistrer sous...

source: save BLOB as dat file
fr: enregistrer BLOB en tant que fichier dat

source: save BLOB as image file
fr: enregistrer BLOB en tant que fichier image

source: Save Current Query to Favorites
fr: Enregistrer la requête actuelle dans les favoris

source: Save Page As…
fr: Enregistrer la page comme…

source: Save Queries…
fr: Enregistrer les requêtes…

source: Save Query…
fr: Enregistrer la requête…

source: Save Selection to Favorites
fr: Enregistrer la sélection dans les favoris

source: Save View As...
fr: Enregistrer la vue sous...

source: Schema path:
fr: Chemin du schéma :

source: Search in MySQL Documentation
fr: Rechercher dans la documentation MySQL

source: Search in MySQL Help
fr: Rechercher dans l'aide MySQL

source: Select Active Query
fr: Sélectionner une requête active

source: Select Database
fr: Sélectionner la base de données

source: selected items
fr: éléments sélectionnés

source: Selected Rows (CSV)
fr: Lignes sélectionnées (CSV)

source: Selected Rows (SQL)
fr: Lignes sélectionnées (SQL)

source: Selected Rows (TSV)
fr: Lignes sélectionnées (TSV)

source: Selected Text
fr: Texte sélectionné

source: Selection
fr: Sélection

source: Sequel Ace could not find any columns belonging to this index. Maybe it has been removed already?
fr: La suite Ace n'a pas pu trouver de colonne appartenant à cet index. Peut-être a-t-elle déjà été supprimée ?

source: Sequel Ace only supports and is tested with the default OpenSSH client versions included with macOS. Using different clients might cause connection issues, security risks or not work at all. Please be aware, that we cannot provide support for such configurations.
fr: Sequel Ace ne prend en charge que et est testé avec les versions par défaut du client OpenSSH incluses avec macOS. L'utilisation de différents clients peut causer des problèmes de connexion, des risques de sécurité ou ne pas fonctionner du tout. Veuillez être conscient que nous ne pouvons pas fournir de support pour de telles configurations.

source: sequelace URL scheme command not supported.
fr: commande de schéma d'URL de suite non prise en charge.

source: sequelace URL Scheme Error
fr: Erreur de schéma d'URL de la suite

source: Server
fr: Serveur

source: Server Default (%@)
fr: Serveur par défaut (%@)

source: Server Processes on %@
fr: Processus serveur sur %@

source: Session
fr: Séance

source: Show as HTML
fr: Afficher en HTML

source: Show as HTML Tooltip
fr: Afficher sous forme d'infobulle HTML

source: Show as Text Tooltip
fr: Afficher comme info-bulle de texte

source: Show Console
fr: Afficher la console

source: Show Create Function Syntax...
fr: Afficher la syntaxe de la fonction de création...

source: Show Create Procedure Syntax...
fr: Afficher la syntaxe de création de la procédure...

source: Show Create Syntaxes...
fr: Afficher la création de syntaxes...

source: Show Create Table Syntax...
fr: Afficher la création de syntaxe de tableau...

source: Show Create View Syntax...
fr: Afficher la syntaxe de création de vue...

source: Show Detail
fr: Afficher les détails

source: Show MySQL help for %@
fr: Afficher l'aide MySQL pour %@

source: Show Tab Bar
fr: Afficher la barre d'onglets

source: Show the console which shows all MySQL commands performed by Sequel Ace
fr: Afficher la console qui affiche toutes les commandes MySQL exécutées par Séquel Ace

source: Show Toolbar
fr: Afficher la barre d'outils

source: Showing %lu of %lu processes
fr: Montrer %1$lu processus sur %2$lu

source: Shutdown
fr: Arrêt

source: Shutdown failed!
fr: L'arrêt a échoué !

source: Signed: %@ to %@ Unsigned: %@ to %@
fr: Signed: %1$@ à %2$@ Non signée : %3$@ à %4$@

source: size: %@
fr: taille : %@

source: Skip existing
fr: Ignorer les éléments existants

source: Skip problems
fr: Ignorer les problèmes

source: Beta Build
fr: Version bêta

source: Socket connection failed!
fr: Échec de la connexion à la socket !

source: Socket not found!
fr: Socket introuvable !

source: Some of the target export folders are not writable. Please select a new export location and try again.
fr: Certains des dossiers d'exportation cibles ne sont pas modifiables. Veuillez sélectionner un nouvel emplacement d'exportation et réessayez.

source: Some of the target export folders no longer exist. Please select a new export location and try again.
fr: Certains des dossiers d'exportation cible n'existent plus. Veuillez sélectionner un nouvel emplacement d'exportation et réessayer.

source: Sorting table...
fr: Tri de la table...

source: SQL Data Access
fr: Accès aux données SQL

source: Connection Secured via SSL
fr: Connexion sécurisée par SSL

source: SSH Connected
fr: SSH connecté

source: SSH connecting...
fr: Connexion SSH...

source: SSH Connecting…
fr: Connexion SSH en cours…

source: SSH connection failed!
fr: Échec de la connexion SSH!

source: SSH Disconnected
fr: SSH déconnecté

source: SSH Key not found
fr: Clé SSH introuvable

source: SSH port forwarding failed
fr: La redirection du port SSH a échoué

source: SSL Certificate Authority File not found
fr: Fichier d'autorité de certification SSL introuvable

source: SSL Certificate File not found
fr: Fichier de certificat SSL introuvable

source: SSL connection not established
fr: Connexion SSL non établie

source: SSL Key File not found
fr: Fichier de clé SSL introuvable

source: Standard memory
fr: Mémoire standard

source: started
fr: démarré

source: Status file for sequelace url scheme command couldn't be written!
fr: Le fichier de statut pour la commande de schéma d'url de la suite n'a pas pu être écrit !

source: Stop
fr: Arrêter

source: Stop queries
fr: Arrêter les requêtes

source: Stop query
fr: Arrêter la requête

source: Stores a date and time of day as seconds since the beginning of the UNIX epoch (1970-01-01 00:00:00). The values displayed/stored are affected by the connection's @@time_zone setting. The representation is the same as for DATETIME. Invalid values, as well as "second zero", are converted to 0000-00-00 00:00:00.0. Fractional seconds were added in MySQL 5.6.4 with a precision down to microseconds (6), specified by F. Some additional rules may apply.
fr: Enregistre une date et une heure de la journée en tant que secondes depuis le début de l'époque UNIX (1970-01-01 00:00:00). Les valeurs affichées/stockées sont affectées par le paramètre @@time_zone de la connexion. La représentation est la même que pour DATETIME. Les valeurs invalides, ainsi que le "second zéro", sont converties en 0000-00-00 00:00:00.0. Les secondes fractionnelles ont été ajoutées dans MySQL 5. .4 avec une précision jusqu'à des microsecondes (6), spécifiée par F. Certaines règles supplémentaires peuvent s'appliquer.

source: Stores a date and time of day. The representation is YYYY-MM-DD HH:MM:SS[.I*], I being fractional seconds. The value is not affected by any time zone setting. Invalid values are converted to 0000-00-00 00:00:00.0. Fractional seconds were added in MySQL 5.6.4 with a precision down to microseconds (6), specified by F.
fr: Enregistre une date et une heure de la journée. La représentation est AAAA-MM-JJ HH:MM:SS[. *], je suis en secondes fractionnées. La valeur n'est pas affectée par aucun réglage de fuseau horaire. Les valeurs invalides sont converties en 0000-00-00 00:00:00.0. Les secondes fractionnelles ont été ajoutées en MySQL 5.6.4 avec une précision jusqu'à microsecondes (6), spécifiées par F.

source: Stores a date without time information. The representation is YYYY-MM-DD. The value is not affected by any time zone setting. Invalid values are converted to 0000-00-00.
fr: Stocke une date sans information d'heure. La représentation est AAAA-MM-JJ. La valeur n'est affectée par aucun paramètre de fuseau horaire. Les valeurs non valides sont converties en 0000-00-00.

source: Stores a time of day, duration or time interval. The representation is HH:MM:SS[.I*], I being fractional seconds. The value is not affected by any time zone setting. Invalid values are converted to 00:00:00. Fractional seconds were added in MySQL 5.6.4 with a precision down to microseconds (6), specified by F.
fr: Stocke une heure de jour, de durée ou d'intervalle. La représentation est HH:MM:SS[. *], je suis en secondes fractionnées. La valeur n'est pas affectée par aucun réglage de fuseau horaire. Les valeurs invalides sont converties en 00:00:00. Les secondes fractionnées ont été ajoutées en MySQL 5.6.4 avec une précision jusqu'à microsecondes (6), spécifiée par F.

source: Successfully analyzed all selected items.
fr: Analyse réussie de tous les éléments sélectionnés.

source: Successfully analyzed table.
fr: Tableau analysé avec succès.

source: Successfully flushed all selected items.
fr: Tous les éléments sélectionnés ont été vidés avec succès.

source: Successfully flushed privileges.
fr: Les privilèges ont été effacés avec succès.

source: Successfully flushed table.
fr: La table a été vidée avec succès.

source: Successfully optimized all selected items.
fr: Optimisation réussie de tous les éléments sélectionnés.

source: Successfully optimized table.
fr: Table optimisée avec succès.

source: Successfully repaired all selected items.
fr: Tous les éléments sélectionnés ont été réparés avec succès.

source: Successfully repaired table.
fr: Table réparée avec succès.

source: Switch to the Run Query tab
fr: Basculer vers l’onglet Exécuter la requête

source: Switch to the Table Content tab
fr: Basculer vers l'onglet Contenu de la table

source: Switch to the Table Info tab
fr: Basculer vers l'onglet Info Tableau

source: Switch to the Table Relations tab
fr: Basculer vers l'onglet Relations de la table

source: Switch to the Table Structure tab
fr: Basculer vers l'onglet Structure de la table

source: Switch to the Table Triggers tab
fr: Basculer vers l'onglet Déclencheurs de la table

source: Switch to the User Manager tab
fr: Basculer vers l'onglet Gestionnaire d'utilisateurs

source: Syntax for %@ table copied
fr: Syntaxe pour la table %@ copiée

source: Table
fr: Tableau

source: Table %lu of %lu (%@): Fetching data...
fr: Table %1$lu de %2$lu (%3$@) : récupération des données...

source: Table %lu of %lu (%@): Fetching relations data...
fr: Tableau %1$lu de %2$lu (%3$@): Récupération des données de relations...

source: Table %lu of %lu (%@): Writing data...
fr: Table %1$lu de %2$lu (%3$@) : Écriture des données...

source: Table changed
fr: Table modifiée

source: Table checksum
fr: Somme de contrôle de la table

source: Table checksum: %@
fr: Somme de contrôle du tableau : %@

source: Table Content
fr: Contenu de la table

source: Table Content (CSV)
fr: Contenu de la table (CSV)

source: Table Content (SQL)
fr: Contenu de la table (SQL)

source: Table Content (TSV)
fr: Contenu de la table (TSV)

source: Table History
fr: Historique du tableau

source: Table Info
fr: Informations sur la table

source: TABLE INFORMATION
fr: INFORMATIONS TABLE

source: Table Information
fr: Informations sur le tableau

source: Table must have a name.
fr: La table doit avoir un nom.

source: Table Preferences
fr: Préférences du tableau

source: Table Relations
fr: Relations avec la table

source: Table Row changed
fr: Ligne de table modifiée

source: Table Structure
fr: Structure de table

source: Table Triggers
fr: Déclencheurs de table

source: Table: %@
fr: Tableau : %@

source: TABLES & VIEWS
fr: TABLES & Vues

source: Testing connection...
fr: Test de la connexion...

source: Testing SSH...
fr: Test de SSH...

source: Text
fr: Texte du texte

source: Text is too long. Maximum text length is set to %llu.
fr: Le texte est trop long. La longueur maximale du texte est définie à %llu.

source: Thanks for updating Sequel Ace!
fr: Merci d'avoir mis à jour Sequel Ace!

source: The Bundle ‘%@’ already exists.
fr: Le bundle ‘%@’ existe déjà.

source: The Bundle ‘%@’ has no UUID which is necessary to identify installed Bundles.
fr: Le bundle ‘%@’ n’a pas d’UUID nécessaire pour identifier les paquets installés.

source: ‘%@’ Bundle contains legacy components
fr: Le bundle ‘%@’ contient des composants hérités

source: In these files: %@ Do you still want to install the bundle?
fr: Dans ces fichiers : %@ Voulez-vous toujours installer le bundle?

source: The chosen file %@ contains ‘%@’ data.
fr: Le fichier choisi «%1$@» contient les données «%2$@».

source: The color theme ‘%@’ already exists.
fr: Le thème de couleur ‘%@’ existe déjà.

source: The connection is busy. Please wait and try again.
fr: La connexion est occupée. Veuillez patienter et réessayer.

source: The connection of the active connection window is not identical.
fr: La connexion de la fenêtre de connexion active n'est pas identique.

source: The connection to the server was lost during the import. The import is only partially complete.
fr: La connexion au serveur a été perdue pendant l'importation. L'importation n'est que partiellement terminée.

source: The creation syntax could not be retrieved due to a permissions error. Please check your user permissions with an administrator.
fr: La syntaxe de création n'a pas pu être récupérée en raison d'une erreur de permission. Veuillez vérifier vos permissions utilisateur avec un administrateur.

source: The CSV file you selected could not be found or read.
fr: Le fichier CSV que vous avez sélectionné n'a pas pu être trouvé ou lu.

source: The CSV was read as containing more than 512 columns, more than the maximum columns permitted for speed reasons by Sequel Ace. This usually happens due to errors reading the CSV; please double-check the CSV to be imported and the line endings and escape characters at the bottom of the CSV selection dialog.
fr: Le CSV a été lu comme contenant plus de 512 colonnes, plus que le maximum autorisé pour des raisons de vitesse par Sequel Ace. Cela se produit généralement à cause d'erreurs de lecture du CSV ; veuillez vérifier le CSV à importer et les extrémités de ligne et les caractères d'échappement en bas de la boîte de dialogue de sélection CSV.

source: The current color theme is unsaved. Do you want to proceed without saving it?
fr: Le thème de couleur actuel n'est pas enregistré. Voulez-vous continuer sans l'enregistrer ?

source: The Custom Query "Run" and "Run All" button positions and their shortcuts have been swapped.
fr: Les positions des boutons « Exécuter des requêtes personnalisées » et « Exécuter tous » et leurs raccourcis ont été échangés.

source: The following default Bundles were updated: %@ Your modifications were stored as “(user)”.
fr: Les Bundles par défaut suivants ont été mis à jour : %@ Vos modifications ont été enregistrées en tant que « (utilisateur)».

source: The following error occurred during the export process: %@
fr: L'erreur suivante s'est produite lors du processus d'exportation : %@

source: The following error occurred during the import process: %@
fr: L'erreur suivante s'est produite pendant le processus d'import : %@

source: The foreign key relationship '%@' has a dependency on index '%@'. This relationship must be removed before the index can be deleted. Are you sure you want to continue to delete the relationship and the index? This action cannot be undone.
fr: La relation de clé étrangère '%1$@' a une dépendance sur l'index '%2$@'. Cette relation doit être supprimée avant de pouvoir supprimer l'index. Êtes-vous sûr de vouloir supprimer la relation et l'index ? Cette action ne peut pas être annulée.

source: The list of tables has changed
fr: La liste des tables a changé

source: The name '%@' is already used.
fr: Le nom '%@' est déjà utilisé.

source: The number of tables in this database has changed since the export dialog was opened. There are now %lu additional table(s), most likely added by an external application. How would you like to proceed?
fr: Le nombre de tables dans cette base de données a changé depuis l'ouverture de la boîte de dialogue d'exportation. Il y a maintenant %lu table(s) supplémentaire(s), probablement ajoutée(s) par une application externe. Comment souhaitez-vous procéder ?

source: The row was not written to the MySQL database. You probably haven't changed anything. Reload the table to be sure that the row exists and use a primary key for your table. (This error can be turned off in the preferences.)
fr: La ligne n'a pas été écrite dans la base de données MySQL. Vous n'avez probablement rien changé. Recharger la table pour être sûr que la ligne existe et utiliser une clé primaire pour votre table. (Cette erreur peut être désactivée dans les préférences.)

source: The selected export settings were stored with version %1$ld, but only settings with the following versions can be imported: %2$@. Either save the settings in a backwards compatible way or update your version of Sequel Ace.
fr: Les paramètres d'exportation sélectionnés ont été enregistrés avec la version%1$ld, mais seuls les paramètres avec les versions suivantes peuvent être importés : %2$@. Soit enregistrer les paramètres de manière rétrocompatible ou mettre à jour votre version de Sequel Ace.

source: The selected file contains data of type “%1$@”, but type “%2$@” is needed. Please choose a different file.
fr: Le fichier sélectionné contient des données de type «%1$@», mais le type «%2$@» est nécessaire. Veuillez choisir un autre fichier.

source: The selected file is either not a valid SPF file or severely corrupted.
fr: Le fichier sélectionné n'est pas un fichier SPF valide ou est gravement corrompu.

source: The selected relation couldn't be deleted. MySQL said: %@
fr: La relation sélectionnée n'a pas pu être supprimée. MySQL a dit: %@

source: The selected trigger couldn't be deleted. MySQL said: %@
fr: Le déclencheur sélectionné n'a pas pu être supprimé. MySQL a dit: %@

source: The smallest integer type, requires 1 byte storage space. M is the optional display width and does not affect the possible value range.
fr: Le type d'entier le plus petit requiert un espace de stockage de 1 octet. M est la largeur d'affichage optionnelle et n'affecte pas la plage de valeurs possible.

source: The socket file could not be found in any common location. Please supply the correct socket location. MySQL said: %@
fr: Le fichier socket n'a pas pu être trouvé à un endroit commun. Veuillez fournir le bon emplacement de socket. MySQL a dit: %@

source: The specified relation could not be created. MySQL said: %@
fr: La relation spécifiée n'a pas pu être créée. MySQL a dit: %@
