Repository: CrazyForks/Sequel-Ace
Catalog: Resources/Localization/*.lproj/Localizable.strings
Languages: fr

source: WARNING: Setting the auto-complete delay to 0.0 can result in strange output.
fr: AVERTISSEMENT : Définir le délai de saisie automatique à 0.0 peut entraîner une sortie étrange.

source: %@ of %@
fr: %@ de %@

source: time_zone will be set to SYSTEM.
fr: time_zone sera défini sur SYSTEM.

source: Check for Updates...
fr: Vérifier les mises à jour...

source: The skip-show-database variable of the database server is set to ON. Thus, you won't be able to list databases unless you have the SHOW DATABASES privilege. However, the databases are still accessible directly through SQL queries depending on your privileges.
fr: La variable skip-show-database du serveur de base de données est définie à ON. Ainsi, vous ne pourrez pas lister les bases de données si vous n'avez pas le privilège SHOW DATABASES. Cependant, les bases de données sont toujours accessibles directement par les requêtes SQL en fonction de vos privilèges.

source: GitHub Request Failed
fr: La requête GitHub a échoué

source: No Newer Release Available
fr: Aucune nouvelle version disponible

source: You are currently running the latest release.
fr: Vous utilisez actuellement la dernière version.

source: Never show this again
fr: Ne plus afficher ceci

source: The current field "%@" is a generated column and therefore cannot be edited.
fr: Le champ actuel "%@" est une colonne générée et ne peut donc pas être modifié.

source: The use of the "default" column has changed since the last version of Sequel ACE: - No default value : Leave it blank. - String value : Use single '' or double quotes "" if you want an empty string or to wrap a string - Expression : Use parentheses (). Except for the TIMESTAMP and DATETIME columns where you can specify the CURRENT_TIMESTAMP function without enclosing parentheses.
fr: L'utilisation de la colonne "par défaut" a changé depuis la dernière version de l'ACE de Sequel : - Aucune valeur par défaut : Laisser vide. - Valeur de chaîne : Utiliser des guillemets simples '' ou doubles "" si vous voulez une chaîne vide ou pour envelopper une chaîne - Expression : Utiliser des parenthèses (). Sauf pour les colonnes TIMESTAMP et DATETIME où vous pouvez spécifier la fonction CURRENT_TIMESTAMP sans enfermer les parenthèses.

source: Pin View
fr: Épingler l'affichage

source: Pin Table
fr: Épingler la table

source: Pin Procedure
fr: Procédure d'épingle

source: Pin Function
fr: Fonction Pin

source: Unpin View
fr: Désépingler l'affichage

source: Unpin Table
fr: Désépingler la table

source: Unpin Procedure
fr: Désépingler la procédure

source: Unpin Function
fr: Désépingler la fonction

source: Copy Table Name
fr: Copier le nom du tableau

source: LaunchFavorite URL Scheme Error
fr: Erreur de schéma d'URL de LaunchFavorite

source: The variable in the ?name= query parameter could not be matched with any of your favorites.
fr: La variable dans le paramètre de requête ?name= n'a pas pu être associée à aucun de vos favoris.
