Repository: CrazyForks/Sequel-Ace
Catalog: Resources/Localization/*.lproj/Localizable.strings
Languages: fr

source: The specified trigger was unable to be created. MySQL said: %@
fr: Le déclencheur spécifié n'a pas pu être créé. MySQL a dit: %@

source: The SQL file uses utf8mb4 encoding, but your MySQL version only supports the limited utf8 subset. You can continue the import, but any non-BMP characters in the SQL file (eg. some typographic and scientific special characters, archaic CJK logograms, emojis) will be unrecoverably lost!
fr: Le fichier SQL utilise l'encodage utf8mb4, mais votre version MySQL ne supporte que le sous-ensemble limité utf8. Vous pouvez continuer l'importation, mais tous les caractères non-BMP dans le fichier SQL (par ex. quelques caractères spéciaux typographiques et scientifiques, des logos archaïques CJK, des emojis) seront perdus de façon irrécupérable!

source: The SQL file you selected could not be found or read.
fr: Le fichier SQL que vous avez sélectionné n'a pas pu être trouvé ou lu.

source: The SSH password could not be loaded from the keychain; please enter the SSH password for %@:
fr: Le mot de passe SSH n'a pas pu être chargé depuis le trousseau; veuillez entrer le mot de passe SSH pour %@:

source: The SSH password could not be loaded; please enter the SSH password for %@:
fr: Le mot de passe SSH n'a pas pu être chargé; veuillez entrer le mot de passe SSH pour %@:

source: The SSH Tunnel could not authenticate with the remote host. Please check your password and ensure you still have access.
fr: Le tunnel SSH n'a pas pu s'authentifier avec l'hôte distant. Veuillez vérifier votre mot de passe et vous assurer que vous avez toujours accès.

source: The SSH Tunnel has unexpectedly closed.
fr: Le tunnel SSH a été fermé de manière inattendue.

source: The SSH Tunnel was closed 'by the remote host'. This may indicate a networking issue or a network timeout.
fr: Le tunnel SSH a été fermé 'par l'hôte distant'. Cela peut indiquer un problème de réseau ou un délai d'attente réseau.

source: The SSH Tunnel was established successfully, but could not forward data to the remote port as the remote port refused the connection.
fr: Le tunnel SSH a été établi avec succès, mais n'a pas pu transférer les données vers le port distant car le port distant a refusé la connexion.

source: The SSH Tunnel was unable to bind to the local port. This error may occur if you already have an SSH connection to the same server and are using a 'LocalForward' setting in your SSH configuration. Would you like to fall back to a standard connection to localhost in order to use the existing tunnel?
fr: Le tunnel SSH n'a pas pu être lié au port local. Cette erreur peut se produire si vous avez déjà une connexion SSH vers le même serveur et que vous utilisez un paramètre 'LocalForward' dans votre configuration SSH. Voulez-vous revenir à une connexion standard à localhost afin d'utiliser le tunnel existant ?

source: The SSH Tunnel was unable to connect to host %@, or the request timed out. Be sure that the address is correct and that you have the necessary privileges, or try increasing the connection timeout (currently %ld seconds).
fr: Le tunnel SSH n'a pas pu se connecter à l'hôte %1$@, ou la requête a expiré. Assurez-vous que l'adresse est correcte et que vous avez les privilèges nécessaires, ou essayez d'augmenter le délai de connexion (actuellement %2$ld secondes).

source: The table data couldn't be loaded presumably due to used filter clause. MySQL said: %@
fr: Les données de la table n'ont pas pu être chargées probablement en raison de la clause de filtre utilisée. MySQL a dit: %@

source: The table data couldn't be loaded. MySQL said: %@
fr: Les données de la table n'ont pas pu être chargées. MySQL a dit: %@

source: The target export folder is not writable. Please select a new export location and try again.
fr: Le dossier d'exportation cible n'est pas accessible en écriture. Veuillez sélectionner un nouvel emplacement d'exportation et réessayez.

source: No directory selected. Please select a new export location and try again.
fr: Aucun répertoire sélectionné. Veuillez sélectionner un nouvel emplacement d'exportation et réessayer.

source: No directory selected.
fr: Aucun répertoire sélectionné.

source: Please select a new export location and try again.
fr: Veuillez sélectionner un nouvel emplacement d'exportation et réessayer.

source: The target export folder no longer exists. Please select a new export location and try again.
fr: Le dossier d'exportation cible n'existe plus. Veuillez sélectionner un nouvel emplacement d'exportation et réessayer.

source: Theme Name:
fr: Nom du thème :

source: Themes Installation Error
fr: Erreur d'installation des thèmes

source: There have been errors while copying table content. Please check the new table.
fr: Il y a eu des erreurs lors de la copie du contenu de la table. Veuillez vérifier la nouvelle table.

source: Cannot duplicate a table with triggers to a different database.
fr: Impossible de dupliquer une table avec des triggers dans une base de données différente.

source: There were no errors.
fr: Il n'y a pas d'erreurs.

source: This field is part of a foreign key relationship with the table '%@'. This relationship must be removed before the field can be deleted. Are you sure you want to continue to delete the relationship and the field? This action cannot be undone.
fr: Ce champ fait partie d'une relation de clé étrangère avec la table '%@'. Cette relation doit être supprimée avant que le champ ne puisse être supprimé. Êtes-vous sûr de vouloir supprimer la relation et le champ ? Cette action ne peut pas être annulée.

source: This index cannot be deleted, because it is used by an existing foreign key relationship. Please remove the relationship, before trying to remove this index. MySQL said: %@
fr: Cet index ne peut pas être supprimé, car il est utilisé par une relation de clé étrangère existante. Veuillez supprimer la relation, avant d'essayer de supprimer cet index. MySQL a dit: %@

source: This is an alias for BIGINT UNSIGNED NOT NULL AUTO_INCREMENT UNIQUE.
fr: Ceci est un alias pour BIGINT UNSIGNED NOT NULL AUTO_INCREMENT UNIQUE.

source: This is an alias for DECIMAL.
fr: Ceci est un alias pour DECIMAL.

source: This is an alias for DOUBLE, unless REAL_AS_FLOAT is configured.
fr: C'est un alias pour DOUBLE, sauf si REAL_AS_FLOAT est configuré.

source: This is an alias for DOUBLE.
fr: Ceci est un alias pour DOUBLE.

source: This is an alias for TINYINT(1).
fr: Ceci est un alias pour TINYINT(1).

source: This is the default collation of database %@.
fr: C'est le collationnement par défaut de la base de données %@.

source: This is the default collation of encoding %@.
fr: C'est le collationnement par défaut de l'encodage %@.

source: This is the default collation of table %@.
fr: C'est le collationnement par défaut de la table %@.

source: This is the default collation of this server.
fr: C'est le collationnement par défaut de ce serveur.

source: This is the default encoding of database %@.
fr: C'est l'encodage par défaut de la base de données %@.

source: This is the default encoding of table %@.
fr: C'est l'encodage par défaut de la table %@.

source: This is the default encoding of this server.
fr: C'est l'encodage par défaut de ce serveur.

source: This table currently does not support relations. Only tables that use the InnoDB storage engine support them.
fr: Cette table ne supporte pas actuellement les relations. Seules les tables qui utilisent le moteur de stockage InnoDB le supportent.

source: This user doesn't have any hosts associated with it. It will be deleted unless one is added
fr: Cet utilisateur n'a aucun hôte associé. Il sera supprimé à moins qu'il ne soit ajouté

source: This user doesn't seem to have any associated hosts and will be removed unless a host is added.
fr: Cet utilisateur ne semble pas avoir d'hôtes associés et sera supprimé à moins qu'un hôte ne soit ajouté.

source: This will wait for open transactions to complete and then quit the mysql daemon. Afterwards neither you nor anyone else can connect to this database! Full management access to the server's operating system is required to restart MySQL!
fr: Cela attendra que les transactions ouvertes se terminent, puis quittera le démon mysql. Ensuite, ni vous ni personne d'autre ne pouvez vous connecter à cette base de données ! Un accès complet à la gestion du système d'exploitation du serveur est nécessaire pour redémarrer MySQL!

source: Time
fr: Date et heure

source: Triggers
fr: Déclencheurs

source: Triggers for table: %@
fr: Déclencheurs pour la table : %@

source: Truncate
fr: Tronquer

source: Truncate selected tables?
fr: Tronquer les tables sélectionnées ?

source: Truncate Table...
fr: Tronquer la table...

source: Truncate table '%@'?
fr: Tronquer la table '%@ ' ?

source: Truncate Tables
fr: Tables tronqués

source: Type
fr: Type de texte

source: Type Declaration:
fr: Déclaration de type :

source: Unable to add index
fr: Impossible d'ajouter l'index

source: Unable to analyze selected items
fr: Impossible d'analyser les éléments sélectionnés

source: Unable to analyze table
fr: Impossible d'analyser la table

source: Unable to check selected items
fr: Impossible de vérifier les éléments sélectionnés

source: Unable to check table
fr: Impossible de vérifier la table

source: Unable to connect to host %@ because access was denied. Double-check your username and password and ensure that access from your current location is permitted. MySQL said: %@
fr: Impossible de se connecter à l'hôte %1$@ car l'accès a été refusé. Vérifiez votre nom d'utilisateur et votre mot de passe et assurez-vous que l'accès à partir de votre emplacement actuel est autorisé. MySQL a dit: %2$@

source: Unable to connect to host %@ because the port connection via SSH was refused. Please ensure that your MySQL host is set up to allow TCP/IP connections (no --skip-networking) and is configured to allow connections from the host you are tunnelling via. You may also want to check the port is correct and that you have the necessary privileges. Checking the error detail will show the SSH debug log which may provide more details. MySQL said: %@
fr: Impossible de se connecter à l'hôte %1$@ car la connexion via SSH a été refusée. Veuillez vous assurer que votre hôte MySQL est configuré pour autoriser les connexions TCP/IP (sans --skip-networking) et est configuré pour autoriser les connexions depuis l'hôte que vous utilisez via le tunnel. Vous pouvez également vérifier que le port est correct et que vous avez les privilèges nécessaires. Vérifier le détail de l'erreur affichera le journal de débogage SSH qui peut fournir plus de détails. MySQL a dit: %2$@

source: Unable to connect to host %@, or the request timed out. Be sure that the address is correct and that you have the necessary privileges, or try increasing the connection timeout (currently %ld seconds). MySQL said: %@
fr: Impossible de se connecter à l'hôte %1$@, ou la requête a expiré. Assurez-vous que l'adresse est correcte et que vous avez les privilèges nécessaires, ou essayez d'augmenter le délai de connexion (actuellement %2$ld secondes). MySQL a dit: %3$@

source: Unable to connect via the socket, or the request timed out. Double-check that the socket path is correct and that you have the necessary privileges, and that the server is running. MySQL said: %@
fr: Impossible de se connecter via le socket, ou la requête a expiré. Vérifiez que le chemin du socket est correct et que vous avez les privilèges nécessaires et que le serveur fonctionne. MySQL a dit: %@

source: Unable to copy database
fr: Impossible de copier la base de données

source: Unable to delete index
fr: Impossible de supprimer l'index

source: Unable to delete relation
fr: Impossible de supprimer la relation

source: Unable to delete trigger
fr: Impossible de supprimer le déclencheur

source: Unable to flush selected items
fr: Impossible de vider les éléments sélectionnés

source: Unable to flush table
fr: Impossible de vider la table

source: Unable to get list of users
fr: Impossible d'obtenir la liste des utilisateurs

source: Unable to kill connection
fr: Impossible de tuer la connexion

source: Unable to kill query
fr: Impossible de tuer la requête

source: Unable to optimze selected items
fr: Impossible d'optimiser les éléments sélectionnés

source: Unable to optimze table
fr: Impossible d'optimiser la table

source: Unable to perform the checksum
fr: Impossible d'effectuer la somme de contrôle

source: Unable to remove host
fr: Impossible de supprimer l'hôte

source: Unable to rename database
fr: Impossible de renommer la base de données

source: Unable to repair selected items
fr: Impossible de réparer les éléments sélectionnés

source: Unable to repair table
fr: Impossible de réparer la table

source: Unable to select database %@. Please check you have the necessary privileges to view the database, and that the database still exists.
fr: Impossible de sélectionner la base de données %@. Veuillez vérifier que vous avez les privilèges nécessaires pour afficher la base de données, et que la base de données existe toujours.

source: Unable to write row
fr: Impossible d'écrire la ligne

source: Unexpected number of rows removed!
fr: Nombre de lignes inattendu supprimé !

source: Unknown file format
fr: Format de fichier inconnu

source: Unsaved changes
fr: Modifications non enregistrées

source: Unsaved Theme
fr: Thème non enregistré

source: Unsupported configuration!
fr: Configuration non prise en charge !

source: Unsupported version for export settings!
fr: Version non prise en charge pour les paramètres d'export !

source: Untitled
fr: Sans titre

source: Untitled %ld
fr: Sans titre %ld

source: Up to %@ bytes (16 MiB)
fr: Jusqu'à %@ octets (16 MiB)

source: Up to %@ bytes (4 GiB)
fr: Jusqu'à %@ bytes (4 GiB)

source: Up to %@ characters (16 MiB)
fr: Jusqu"à %@ caractères (16 Mo)

source: Up to %@ distinct members (<%@ in practice) 1-2 bytes storage
fr: Jusqu'à %1$@ membres distincts (<%2$@ en pratique) 1-2 octets de stockage

source: Up to 255 bytes
fr: Jusqu'à 255 octets

source: Up to 255 characters
fr: Jusqu'à 255 caractères

source: Update
fr: Mise à jour

source: updated: %@
fr: mis à jour : %@

source: Updating field content failed. Couldn't identify field origin unambiguously (%1$ld matches). It's very likely that while editing this field of table `%2$@` was changed.
fr: La mise à jour du contenu du champ a échoué. Impossible d'identifier l'origine du champ sans ambiguïté (%1$ld correspondances). Il est très probable que lors de la modification de ce champ de la table `%2$@`, celui-ci ait été modifié.

source: Updating field content failed. Couldn't identify field origin unambiguously (%1$ld matches). It's very likely that while editing this field the table `%2$@` was changed by an other user.
fr: La mise à jour du contenu du champ a échoué. Impossible d'identifier l'origine du champ sans ambiguïté (%1$ld correspondances). Il est très probable que lors de la modification de ce champ, la table `%2$@` ait été modifiée par un autre utilisateur.

source: Updating field data...
fr: Mise à jour des données du champ...

source: URL scheme command couldn't authenticated
fr: La commande du schéma d'URL n'a pas pu être authentifiée

source: URL scheme command was terminated by user
fr: La commande du schéma d'URL a été terminée par l'utilisateur

source: URL scheme command %@ unsupported
fr: Commande de schéma d'URL %@ non prise en charge

source: Use 127.0.0.1
fr: Utiliser 127.0.0.1

source: Use Standard Connection
fr: Utiliser la connexion standard

source: User has no hosts
fr: L'utilisateur n'a pas d'hôtes

source: User-defined value
fr: Valeur définie par l'utilisateur

source: Users
fr: Utilisateurs

source: Value will be imported as MySQL NULL
fr: La valeur sera importée en tant que NULL MySQL

source: view
fr: Voir

source: View full release notes
fr: Voir toutes les notes de version

source: VIEW INFORMATION
fr: AFFICHER LES INFORMATIONS

source: View Source
fr: Voir la source

source: View Structure
fr: Voir la structure

source: views
fr: Vues

source: Warning
fr: Avertissement

source: We've changed Sequel Ace's digital signature for GateKeeper compatibility; you'll have to allow access to your passwords again.
fr: Nous avons changé la signature numérique de Sequel Ace pour la compatibilité GateKeeper; vous devrez autoriser l'accès à vos mots de passe à nouveau.

source: We've made a few changes but we thought you should know about one particularly important one:
fr: Nous avons fait quelques modifications, mais nous pensions que vous devriez en savoir un particulièrement important :

source: We've made a few changes but we thought you should know about some particularly important ones:
fr: Nous avons fait quelques modifications, mais nous pensions que vous devriez en savoir plus sur certains d'entre eux particulièrement importants :

source: WHERE clause not valid
fr: Clause WHERE non valide

source: WHERE NOT query
fr: Où, PAS de requête

source: WHERE query
fr: Requête WHERE

source: Working...
fr: Traitement...

source: Writing data...
fr: Écriture des données...

source: Writing...
fr: Écriture en cours...

source: Wrong data format or password.
fr: Format de données ou mot de passe incorrect.

source: Wrong data format.
fr: Mauvais format de données.

source: Wrong SPF content type!
fr: Mauvais type de contenu SPF !

source: Year
fr: Année

source: You can only copy single rows.
fr: Vous ne pouvez copier que des lignes simples.

source: You can't hide blob and text fields when working with tables without index.
fr: Vous ne pouvez pas masquer les champs blob et texte lorsque vous travaillez avec des tables sans index.

source: You cannot delete the last field in a table. Delete the table instead.
fr: Vous ne pouvez pas supprimer le dernier champ d'une table. Supprimez la table à la place.

source: You requested that the connection should be established using SSL, but MySQL made the connection without SSL. This may be because the server does not support SSL connections, or has SSL disabled; or insufficient details were supplied to establish an SSL connection. This connection is not encrypted.
fr: Vous avez demandé que la connexion soit établie en utilisant SSL, mais MySQL a fait la connexion sans SSL. Cela peut être dû au fait que le serveur ne prend pas en charge les connexions SSL, ou a SSL désactivé ; ou des détails insuffisants ont été fournis pour établir une connexion SSL. Cette connexion n'est pas chiffrée.

source: ‘%@’ based favorites
fr: Favoris basés sur «%@»

source: ‘%@’ Fields Content Filters
fr: Filtres de contenu des champs ‘%@’

source: %@ already exists. Do you want to replace it?
fr: %@ existent déjà. Voulez-vous les remplacer ?

source: %@ Bundle
fr: Lot %@

source: %@ could not be created
fr: %@ n'a pas pu être créé

source: %@ couldn't be parsed. You can edit the column setup but the column will not be shown in the Content view; please report this issue to the Sequel Ace team using the Help menu item.
fr: %@ n'a pas pu être analysé. Vous pouvez modifier la configuration de la colonne, mais la colonne ne sera pas affichée dans la vue Contenu ; Veuillez signaler ce problème à l'équipe de Sequel Ace à l'aide du menu Aide.

source: %@ is not a valid client certificate file.
fr: %@ n'est pas un fichier de certificat client valide.

source: %@ is not a valid private key file.
fr: %@ n'est pas un fichier de clé privée valide.

source: App Sandbox Issue
fr: Problème de l'application Sandbox

source: Stale Bookmarks
fr: Marque-pages de l'histoire

source: App Sandbox Info
fr: Infos de l'application Sandbox

source: File Selection Error
fr: Erreur de sélection de fichier

source: The selected file is not a valid file. Please try again. Class: %@
fr: Le fichier sélectionné n'est pas un fichier valide. Veuillez réessayer. Classe : %@

source: The selected known hosts file is not writable. %@ Please re-select the file in Sequel Ace's Preferences and try again.
fr: Le fichier hosts sélectionné n'est pas accessible en écriture. %@ Veuillez re-sélectionner le fichier dans les préférences de Sequel Ace et réessayer.

source: The selected known hosts file is invalid. Please re-select the file in Sequel Ace's Preferences and try again.
fr: Le fichier hôte sélectionné est invalide. Veuillez re-sélectionner le fichier dans les préférences de Sequel Ace et réessayer.

source: The selected known hosts file contains a quote (") in its file path which is not supported. %@ Please select a different file in Sequel Ace's Preferences or rename the file/path to remove the quote.
fr: Le fichier hôte connu sélectionné contient un guillemet (") dans son chemin de fichier qui n'est pas pris en charge. %@ Veuillez sélectionner un fichier différent dans les Préférences de Sequel Ace ou renommez le fichier/chemin pour supprimer le guillemet.

source: SSH Tunnel Debugging Info
fr: Infos de débogage du tunnel SSH

source: You have stale secure bookmarks: %@ Would you like to re-request access now?
fr: Vous avez dépassé les signets sécurisés : %@ Souhaitez-vous demander un nouvel accès maintenant ?

source: You have missing secure bookmarks: %@ Would you like to request access now?
fr: Il vous manque des signets sécurisés : %@ Voulez-vous demander l'accès maintenant ?

source: Use known hosts from ssh config (ADVANCED)
fr: Utiliser les hôtes connus de la configuration ssh (AVANCED)

source: Yes
fr: Oui

source: A reminder of your stale secure bookmarks:<br /><br />%@<br />
fr: Un rappel de vos favoris sécurisés obsolètes :<br /><br />%@<br />

source: Stale Secure Bookmarks
fr: Signets Stale Secure

source: Export Error
fr: Erreur d'exportation

source: Error while writing to the export file. Could not open file: %@
fr: Erreur lors de l'écriture dans le fichier d'exportation. Impossible d'ouvrir le fichier : %@

source: Resultset from mysql.user contains neither 'Password' nor 'authentication_string' column.
fr: Resultset de mysql.user ne contient ni la colonne 'Mot de passe' ni 'authentication_string'.

source: User Data Error
fr: Erreur de données utilisateur

source: Please re-select the file '%@' in order to restore Sequel Ace's access.
fr: Veuillez sélectionner à nouveau le fichier '%@' afin de restaurer l'accès à Sequel Ace.

source: Please choose a file or folder to grant Sequel Ace access to.
fr: Veuillez choisir un fichier ou un dossier pour accorder l'accès à Sequel Ace.

source: Please choose your ssh config files(s)
fr: Veuillez choisir le(s) fichier(s) de configuration ssh

source: Please choose your known hosts file
fr: Veuillez choisir votre fichier hosts connu

source: Invalid JSON
fr: JSON invalide

source: Applying syntax highlighting...
fr: Application de la coloration syntaxique...

source: Couldn't launch task. Exception reason: %@ ENV length: %lu
fr: Impossible de démarrer la tâche. Raison d'exception : %@ Longueur ENV : %lu

source: New Connection Error
fr: Nouvelle erreur de connexion

source: Failed to create new database connection window. Please restart Sequel Ace and try again.
fr: Impossible de créer une nouvelle fenêtre de connexion à la base de données. Veuillez redémarrer Ace et réessayer.

source: A new version is available
fr: Une nouvelle version est disponible

source: Download
fr: Télécharger

source: Version %@ is available. You are currently running %@
fr: La version %@ est disponible. Vous utilisez actuellement %@

source: Download Progress
fr: Progression du téléchargement

source: Calculating time remaining...
fr: Calcul du temps restant...

source: Downloading Sequel Ace - %@
fr: Téléchargement de Sequel Ace - %@

source: About %.1f seconds left
fr: Il reste environ %.1f secondes

source: Download Failed
fr: Échec du téléchargement

source: Only available for GitHub downloads
fr: Uniquement disponible pour les téléchargements GitHub
