Repository: CrazyForks/Sequel-Ace
Catalog: Resources/Localization/*.lproj/Localizable.strings
Languages: fr

source: Check the Console for possible errors inside the primary key(s) of this table!
fr: Vérifiez la console pour d'éventuelles erreurs dans la ou les clés primaires de cette table!

source: Please check the Console and inform the Sequel Ace team!
fr: Veuillez vérifier la console et informer l'équipe Sequel Ace !

source: Reload the table to be sure that the contents have not changed in the meantime.
fr: Rechargez le tableau pour vous assurer que le contenu n'a pas changé entre-temps.

source: You should also add a primary key to this table!
fr: Vous devez également ajouter une clé primaire à cette table !

source: %@ %@ selected
fr: %1$@ %2$@ sélectionnées

source: %@ (Filtered by %@)
fr: %1$@ (filtrer par %2$@)

source: %@ (Page %lu)
fr: %1$@ (Page %2$lu)

source: %@ Copy
fr: %@ Copier

source: %@ row in partial load
fr: %@ ligne partiellement chargée

source: %@ row in table
fr: %@ ligne dans la table

source: %@ row of %@%@ matches filter
fr: %1$@ ligne sur %2$@%3$@ correspondant au filtre

source: %@ rows in partial load
fr: %@ lignes partiellement chargées

source: %@ rows in table
fr: %@ lignes dans la table

source: %@ rows of %@%@ match filter
fr: %1$@ lignes sur %2$@%3$@ correspondent au filtre

source: %@; %ld rows affected
fr: %1$@; %2$ld lignes affectées

source: %@; %ld rows affected in total, by %ld queries taking %@
fr: %1$@; %2$ld lignes affectées au total, par %3$ld requêtes prenant %4$@

source: %@; 1 row affected
fr: %@; 1 ligne affectée

source: %@; 1 row affected in total, by %ld queries taking %@
fr: %1$@; 1 ligne modifiée au total, par %2$ld requêtes prenant %3$@

source: %@; Cancelled after %@
fr: %1$@; Annulé après %2$@

source: %@; Cancelled in query %ld, after %@
fr: %1$@; Annulé dans la requête %2$ld, après %3$@

source: %@ MySQL said: %@
fr: %1$@ nMySQL dit : %2$@

source: %lu favorite
fr: %lu favori

source: %lu favorites
fr: %lu favoris

source: %lu group
fr: %lu groupe

source: %lu groups
fr: %lu groupes

source: %ld additional rows were removed!
fr: %ld lignes supplémentaires ont été supprimées !

source: %ld of %lu record(s)
fr: %1$ld de %2$lu enregistrement(s)

source: %ld of first %lu record(s)
fr: %1$ld de(s) premier(s) %2$lu enregistrement(s)

source: %ld rows were not removed.
fr: %ld lignes n'ont pas été supprimées.

source: %lu files already exist. Do you want to replace them?
fr: %lu fichiers existent déjà. Voulez-vous les remplacer ?

source: %lu files could not be created
fr: %lu fichiers n'ont pas pu être créés

source: %lu files with the same names already exist in the target folder. Replacing them will overwrite their current contents.
fr: %lu fichiers portant le même nom existent déjà dans le dossier cible. Les remplacer écrasera leur contenu actuel.

source: %lu of %lu
fr: %1$lu de %2$lu

source: %lu of the export files could not be created because their target export folder is not writable; please select a new export location and try again.
fr: %lu des fichiers d'exportation n'ont pas pu être créés car leur dossier d'exportation cible n'est pas accessible en écriture ; veuillez sélectionner un nouvel emplacement d'exportation et réessayez.

source: %lu of the export files could not be created because their target export folder no longer exists; please select a new export location and try again.
fr: %lu des fichiers d'exportation n'ont pas pu être créés car leur dossier d'exportation cible n'existe plus; veuillez sélectionner un nouvel emplacement d'exportation et réessayez.

source: (no selection)
fr: (aucune sélection)

source: (not loaded)
fr: (non chargé)

source: (This usually indicates that the connection has been closed by the server after inactivity, but can also occur due to other conditions. The connection has been restored; please try again if the query is safe to re-run.)
fr: (Cela indique généralement que la connexion a été fermée par le serveur après une inactivité, mais cela peut également se produire en raison d'autres conditions. La connexion a été restaurée ; veuillez réessayer si la requête peut être réexécutée en toute sécurité.)

source: , first row available after %1$@
fr: , première ligne disponible après %1$@

source: , taking %1$@
fr: , prend %1$@

source: [ERROR in query %ld] %@
fr: [EURREUR dans la requête %1$ld] %2$@

source: [ERROR in row %ld] %@
fr: [ERREUR sur la ligne %1$ld] %2$@

source: [multiple selection]
fr: [sélection multiple]

source: [name required]
fr: [Nom obligatoire]

source: [no selection]
fr: [aucune sélection]

source: (In addition, one or more errors occurred while attempting to create the export files: %lu could not be created. These files will be ignored.)
fr: (De plus, une ou plusieurs erreurs se sont produites lors de la tentative de création des fichiers d'exportation : %lu n'a pas pu être créé. Ces fichiers seront ignorés.)

source: Press ⇧ for binary search (case-sensitive).
fr: Appuyez sur <unk> pour une recherche binaire (sensible à la casse).

source: A bit-field type. M specifies the number of bits. If shorter values are inserted, they will be aligned on the least significant bit. See the SET type if you want to explicitly name each bit.
fr: Un type de champ bits. M spécifie le nombre de bits. Si des valeurs plus courtes sont insérées, elles seront alignées sur le bit le moins significatif. Voir le type SET si vous voulez explicitement nommer chaque bit.

source: A Bundle ‘%@’ is already installed. Do you want to update it?
fr: Un pack ‘%@’ est déjà installé. Voulez-vous le mettre à jour ?

source: A byte array with fixed length. Shorter values will always be padded to the right with 0x00 until they fit M.
fr: Un tableau d'octets avec une longueur fixe. Les valeurs plus courtes seront toujours complétées à droite avec 0x00 jusqu'à ce qu'elles soient ajustées à M.

source: A byte array with variable length. The actual number of bytes is further limited by the values of other fields in the row.
fr: Un tableau d'octets de longueur de variable. Le nombre réel d'octets est plus limité par les valeurs des autres champs de la ligne.

source: A byte array with variable length. Unlike VARBINARY this type does not count towards the maximum row length.
fr: Un tableau d'octets de longueur de variable. Contrairement à VARBINARY, ce type ne compte pas pour la longueur maximale de la ligne.

source: A character string that can store up to 255 bytes, but requires less space for shorter values. The actual number of characters is further limited by the used encoding. Unlike VARCHAR this type does not count towards the maximum row length.
fr: Une chaîne de caractères qui peut stocker jusqu'à 255 octets, mais qui nécessite moins d'espace pour des valeurs plus courtes. Le nombre réel de caractères est encore limité par l'encodage utilisé. Contrairement à VARCHAR, ce type ne compte pas pour la longueur maximale de la ligne.

source: A character string that can store up to M bytes, but requires less space for shorter values. The actual number of characters is further limited by the used encoding and the values of other fields in the row.
fr: Une chaîne de caractères qui peut stocker jusqu'à M octets, mais qui nécessite moins d'espace pour des valeurs plus courtes. Le nombre réel de caractères est encore limité par l'encodage utilisé et les valeurs des autres champs de la ligne.

source: A character string that can store up to M bytes, but requires less space for shorter values. The actual number of characters is further limited by the used encoding. Unlike VARCHAR this type does not count towards the maximum row length.
fr: Une chaîne de caractères qui peut stocker jusqu'à M octets, mais qui nécessite moins d'espace pour des valeurs plus courtes. Le nombre réel de caractères est encore limité par l'encodage utilisé. Contrairement à VARCHAR, ce type ne compte pas pour la longueur maximale de la ligne.

source: A character string that will require M×w bytes per row, independent of the actual content length. w is the maximum number of bytes a single character can occupy in the given encoding.
fr: Une chaîne de caractères qui nécessitera des octets M×w par ligne, indépendamment de la longueur réelle du contenu. w est le nombre maximum d'octets qu'un seul caractère peut occuper dans l'encodage donné.

source: A character string with variable length. The actual number of characters is further limited by the used encoding. Unlike VARCHAR this type does not count towards the maximum row length.
fr: Une chaîne de caractères avec une longueur variable. Le nombre réel de caractères est encore limité par l'encodage utilisé. Contrairement à VARCHAR, ce type ne compte pas pour la longueur maximale de la ligne.

source: A data type that validates JSON data on INSERT and internally stores it in a binary format that is both, more compact and faster to access than textual JSON. Available from MySQL 5.7.8.
fr: Un type de données qui valide les données JSON lors de l'INSERT et les stocke en interne dans un format binaire qui est à la fois plus compact et plus rapide d'accès que le JSON textuel . Disponible à partir de MySQL 5.7.8.

source: A file with the same name already exists in the target folder. Replacing it will overwrite its current contents.
fr: Un fichier avec le même nom existe déjà dans le dossier cible. Remplacer le fichier remplacera son contenu actuel.

source: A fixed-point, exact decimal value. M is the maxium number of digits, of which D may be after the decimal point. When rounding, 0-4 is always rounded down, 5-9 up (“round towards nearest”).
fr: Un point fixé, la valeur décimale exacte. M est le nombre maximal de chiffres, dont D peut être après la virgule. En arrondissement, 0-4 est toujours arrondi vers le bas, 5-9 vers le haut (« rond vers le plus près »).

source: A foreign key needs this index
fr: Une clé étrangère a besoin de cet index

source: A SET can define up to 64 members (as strings) of which a field can use one or more using a comma-separated list. Upon insertion the order of members is automatically normalized and duplicate members will be eliminated. Assignment of numbers is supported using the same semantics as for BIT types.
fr: Un SET peut définir jusqu'à 64 membres (comme des chaînes) dont un champ peut utiliser un ou plusieurs en utilisant une liste séparée par des virgules. Lors de l'insertion, l'ordre des membres est automatiquement normalisé et les membres en double seront éliminés. L'affectation des nombres est supportée en utilisant la même sémantique que pour les types BIT.

source: A SSH key location was specified, but no file was found in the specified location. Please re-select the key and try again.
fr: Un emplacement de clé SSH a été spécifié, mais aucun fichier n'a été trouvé dans l'emplacement spécifié. Veuillez re-sélectionner la clé et réessayer.

source: A SSL Certificate Authority certificate location was specified, but no file was found in the specified location. Please re-select the Certificate Authority certificate and try again.
fr: Un certificat d'autorité de certification SSL a été spécifié, mais aucun fichier n'a été trouvé à l'emplacement spécifié. Veuillez sélectionner à nouveau le certificat de l'autorité de certification et réessayer.

source: A SSL certificate location was specified, but no file was found in the specified location. Please re-select the certificate and try again.
fr: Un emplacement de certificat SSL a été spécifié, mais aucun fichier n'a été trouvé à l'emplacement spécifié. Veuillez re-sélectionner le certificat et réessayer.

source: A SSL key file location was specified, but no file was found in the specified location. Please re-select the key file and try again.
fr: Un emplacement de fichier de clé SSL a été spécifié, mais aucun fichier n'a été trouvé à l'emplacement spécifié. Veuillez re-sélectionner le fichier de clé et réessayer.

source: A user with the host '%@' already exists
fr: Un utilisateur avec l'hôte '%@' existe déjà

source: A user with the name '%@' already exists
fr: Un utilisateur avec le nom '%@' existe déjà

source: A valid hex string may only contain the numbers 0-9 and letters A-F (a-f). It can optionally begin with „0x“ and spaces will be ignored. Alternatively the syntax X'val' is supported, too.
fr: Une chaîne hexadécimale valide ne peut contenir que les chiffres 0-9 et les lettres A-F (a-f). Il peut éventuellement commencer par „0x“ et les espaces seront ignorés. Alternativement, la syntaxe X'val' est également prise en charge.

source: Access denied!
fr: Accès refusé !

source: Accurate to approx. 15 decimal places
fr: Préciser à environ 15 décimales

source: Accurate to approx. 7 decimal places
fr: Préciser à environ 7 décimales

source: Active connection window is busy. Please wait and try again.
fr: La fenêtre de connexion active est occupée. Veuillez patienter et réessayer.

source: ACTIVITIES
fr: ACTIVITÉS

source: Add
fr: Ajouter

source: Add Database...
fr: Ajouter une base de données...

source: Add Host
fr: Ajouter un hôte

source: Add Value or Expression…
fr: Ajouter une valeur ou une expression…

source: Adding index...
fr: Ajout de l'index...

source: Advanced
fr: Avancé

source: Alerts & Logs
fr: Alertes et Logs

source: Alerts & Logs Preferences
fr: Préférences alertes et logs

source: All Databases
fr: Toutes les bases de données

source: All Databases (%)
fr: Toutes les bases de données (%)

source: All the export files already exist. Do you want to replace them?
fr: Tous les fichiers d'exportation existent déjà. Voulez-vous les remplacer ?

source: An error for sequelace URL scheme command occurred. Probably no corresponding connection window found.
fr: Une erreur pour la commande de schéma d'URL de suite s'est produite. Probablement aucune fenêtre de connexion correspondante trouvée.

source: An error has occurred and there doesn't seem to be a connection available.
fr: Une erreur est survenue et il ne semble pas y avoir de connexion disponible.

source: An error occur while executing a scheme command. If the scheme command was invoked by a Bundle command, it could be that the command still runs. You can try to terminate it by pressing ⌘+. or via the Activities pane.
fr: Une erreur est survenue lors de l'exécution d'une commande de schéma. Si la commande du schéma était appelée par une commande Bundle, il se peut que la commande soit toujours exécutée. Vous pouvez essayer de le terminer en appuyant sur "+" ou via le volet "Activités".

source: An error occurred while attempting to kill connection %lld. MySQL said: %@
fr: Une erreur est survenue lors de la tentative de fermeture de la connexion %1$lld. MySQL a dit: %2$@

source: An error occurred while attempting to kill the query associated with connection %lld. MySQL said: %@
fr: Une erreur s'est produite lors de la tentative de tuer la requête associée à la connexion %1$lld. MySQL a dit: %2$@

source: An error occurred while creating table syntax. : %@
fr: Une erreur s'est produite lors de la création de la syntaxe de la table. : %@

source: An error occurred while renaming '%@'. No temporary name could be found. Please try renaming to something else first.
fr: Une erreur s'est produite lors du renommage de '%@'. Aucun nom temporaire n'a pu être trouvé. Essayez d'abord de renommer quelque chose d'autre.

source: An error occurred while renaming '%@'. MySQL said: %@
fr: Une erreur s'est produite lors du renommage de '%1$@'. MySQL a dit: %2$@

source: An error occurred while renaming. '%@' is of an unknown type.
fr: Une erreur est survenue lors du renommage. '%@' est d'un type inconnu.

source: An error occurred while renaming. I couldn't delete '%@'. MySQL said: %@
fr: Une erreur s'est produite lors du renommage. Je n'ai pas pu supprimer '%1$@'. MySQL a dit: %2$@

source: An error occurred while renaming. I couldn't recreate '%@'. MySQL said: %@
fr: Une erreur s'est produite lors du renommage. Je n'ai pas pu recréer '%1$@'. MySQL a dit: %2$@

source: An error occurred while renaming. I couldn't retrieve the syntax for '%@'. MySQL said: %@
fr: Une erreur s'est produite lors du renommage. Je n'ai pas pu récupérer la syntaxe pour '%1$@'. MySQL a dit: %2$@

source: An error occurred while renaming. The CREATE syntax of '%@' could not be parsed.
fr: Une erreur s'est produite lors du renommage. La syntaxe CREATE de '%@' n'a pas pu être analysée.

source: An error occurred while retrieving status data. MySQL said: %@
fr: Une erreur s'est produite lors de la récupération des données de statut. MySQL a dit: %@

source: An error occurred while retrieving the create syntax for '%@'. MySQL said: %@
fr: Une erreur s'est produite lors de la récupération de la syntaxe de création pour '%1$@'. MySQL a dit: %2$@

source: An error occurred while trying to add the index. MySQL said: %@
fr: Une erreur s'est produite en essayant d'ajouter l'index. MySQL a dit: %@

source: An error occurred while trying to add the password to your Keychain. Repairing your Keychain might resolve this, but if it doesn't please report it to the Sequel Ace team, supplying the error code %i.
fr: Une erreur est survenue lors de l'ajout du mot de passe à votre trousse. La réparation de votre trousseau pourrait résoudre ce problème, mais si ce n'est pas le cas, veuillez le signaler à l'équipe de Sequel Ace en fournissant le code d'erreur %i.

source: An error occurred while trying to copy the database '%@' to '%@'.
fr: Une erreur est survenue lors de la copie de la base de données '%1$@' vers '%2$@'.

source: An error occurred while trying to delete the index. MySQL said: %@
fr: Une erreur s'est produite en essayant de supprimer l'index. MySQL a dit: %@

source: An error occurred while trying to determine the number of rows for %@. MySQL said: %@ (%lu)
fr: Une erreur s'est produite en essayant de déterminer le nombre de lignes pour «%1$@». MySQL a dit: %2$@ (%3$lu)

source: An error occurred while trying to rename the database '%@' to '%@'.
fr: Une erreur s'est produite en essayant de renommer la base de données '%1$@' en '%2$@'.

source: An error occurred while trying to retrieve the Keychain item you're trying to edit. Repairing your Keychain might resolve this, but if it doesn't please report it to the Sequel Ace team, supplying the error code %i.
fr: Une erreur est survenue lors de la tentative de récupération de l'élément Trousseau que vous essayez de modifier. La réparation de votre trousseau pourrait résoudre ce problème, mais si ce n'est pas le cas, veuillez le signaler à l'équipe de Sequel Ace en fournissant le code d'erreur %i.

source: An error occurred while trying to update the Keychain item. Repairing your Keychain might resolve this, but if it doesn't please report it to the Sequel Ace team, supplying the error code %i.
fr: Une erreur est survenue lors de la mise à jour de l'élément Trousseau La réparation de votre trousseau pourrait résoudre ce problème, mais si ce n'est pas le cas, veuillez le signaler à l'équipe de Sequel Ace en fournissant le code d'erreur %i.

source: An error occurred
fr: Une erreur s'est produite

source: An error occurred retrieving table information. MySQL said: %@
fr: Une erreur s'est produite lors de la récupération des informations de la table. MySQL a dit: %@

source: An error occurred when reading the file, as it could not be read in the encoding you selected (%@). Only %ld queries were executed.
fr: Une erreur s'est produite lors de la lecture du fichier, car il n'a pas pu être lu dans l'encodage sélectionné (%1$@). Seules les requêtes %2$ld ont été exécutées.

source: An error occurred when reading the file, as it could not be read using the encoding you selected (%@). Only %ld rows were imported.
fr: Une erreur s'est produite lors de la lecture du fichier, car il n'a pas pu être lu en utilisant l'encodage que vous avez sélectionné (%1$@). Seules les lignes %2$ld ont été importées.

source: An error occurred when reading the file. Only %ld queries were executed. (%@)
fr: Une erreur s'est produite lors de la lecture du fichier. Seules les requêtes %1$ld ont été exécutées. (%2$@)

source: An error occurred when reading the file. Only %ld rows were imported. (%@)
fr: Une erreur s'est produite lors de la lecture du fichier. Seulement %1$ld lignes ont été importées. (%2$@)

source: An error occurred when trying to add the field '%@' via %@ MySQL said: %@
fr: Une erreur s'est produite en essayant d'ajouter le champ '%1$@' via %2$@ MySQL a dit: %3$@

source: An error occurred when trying to change the field '%@' via %@ MySQL said: %@
fr: Une erreur s'est produite en essayant de changer le champ '%1$@' via %2$@ MySQL a dit: %3$@

source: An error occurred when trying to change the table collation to '%@'. MySQL said: %@
fr: Une erreur s'est produite en essayant de changer le collationnement de la table en '%1$@'. MySQL a dit: %2$@

source: An error occurred when trying to change the table encoding to '%@'. MySQL said: %@
fr: Une erreur s'est produite en essayant de changer l'encodage de la table en '%1$@'. MySQL a dit: %2$@

source: An error occurred when trying to change the table type to '%@'. MySQL said: %@
fr: Une erreur s'est produite lors de la tentative de modification du type de table en '%1$@'. MySQL a dit : %2$@

source: An error occurred when trying to change the table's comment to '%@'. MySQL said: %@
fr: Une erreur s'est produite en essayant de modifier le commentaire de la table à '%1$@'. MySQL a dit: %2$@

source: An error occurred while analyzing the %@. MySQL said:%@
fr: Une erreur est survenue lors de l'analyse de la %1$@. MySQL a dit:%2$@

source: An error occurred while fetching the optimized field type. MySQL said:%@
fr: Une erreur s'est produite lors de la récupération du type de champ optimisé. MySQL a dit:%@

source: An error occurred while flushing the %@. MySQL said:%@
fr: Une erreur est survenue lors du vidage de la %1$@. MySQL a dit:%2$@

source: An error occurred while importing SQL
fr: Une erreur s'est produite lors de l'import SQL

source: An error occurred while optimzing the %@. MySQL said:%@
fr: Une erreur s'est produite lors de l'optimisation de la %1$@. MySQL a dit:%2$@

source: An error occurred while performing the checksum on %@. MySQL said:%@
fr: Une erreur s'est produite lors de l'exécution de la somme de contrôle sur %1$@. MySQL a dit:%2$@

source: An error occurred while repairing the %@. MySQL said:%@
fr: Une erreur s'est produite lors de la réparation de la %1$@. MySQL a dit:%2$@

source: An error occurred while retrieving information. MySQL said: %@
fr: Une erreur s'est produite lors de la récupération des informations. MySQL a dit: %@

source: An error occurred while retrieving the information for table '%@'. Please try again. MySQL said: %@
fr: Une erreur s'est produite lors de la récupération des informations de la table '%1$@'. Veuillez réessayer. MySQL a dit: %2$@

source: An error occurred while retrieving the trigger information for table '%@'. Please try again. MySQL said: %@
fr: Une erreur s'est produite lors de la récupération des informations de déclenchement pour la table '%1$@'. Veuillez réessayer. MySQL a dit: %2$@

source: An error occurred while trying to add the new column '%@' by %@. MySQL said: %@
fr: Une erreur s'est produite en essayant d'ajouter la nouvelle colonne '%1$@' par %2$@. MySQL a dit: %3$@

source: An error occurred while trying to add the new table '%@' by %@. MySQL said: %@
fr: Une erreur s'est produite en essayant d'ajouter la nouvelle table '%1$@' par %2$@. MySQL a dit: %3$@

source: An error occurred while trying to add the new table '%@'. MySQL said: %@
fr: Une erreur s'est produite lors de la tentative d'ajout de la nouvelle table '%1$@'. MySQL a dit : %2$@

source: An error occurred while trying to alter table '%@'. MySQL said: %@
fr: Une erreur s'est produite lors de la tentative de modification de la table '%1$@'. MySQL a dit : %2$@
