Repository: CrazyForks/Sequel-Ace
Catalog: Resources/Localization/*.lproj/Localizable.strings
Languages: fr

source: An error occurred while trying to check the %@. MySQL said:%@
fr: Une erreur est survenue lors de la vérification de l' %1$@. MySQL a dit:%2$@

source: An error occurred while trying to delete the relation '%@'. MySQL said: %@
fr: Une erreur s'est produite en essayant de supprimer la relation '%1$@'. MySQL a dit: %2$@

source: An error occurred while trying to get the list of users. Please make sure you have the necessary privileges to perform user management, including access to the mysql.user table.
fr: Une erreur s'est produite en essayant d'obtenir la liste des utilisateurs. Assurez-vous d'avoir les privilèges nécessaires pour effectuer la gestion des utilisateurs, y compris l'accès à la table mysql.user .

source: An error occurred while trying to import a table via: %@ MySQL said: %@
fr: Une erreur s'est produite en essayant d'importer une table via : %1$@ MySQL a dit: %2$@

source: An error occurred while trying to move the field. MySQL said: %@
fr: Une erreur s'est produite en essayant de déplacer le champ. MySQL a dit: %@

source: An error occurred while trying to reset AUTO_INCREMENT of table '%@'. MySQL said: %@
fr: Une erreur s'est produite en essayant de réinitialiser AUTO_INCREMENT de la table '%1$@'. MySQL a dit: %2$@

source: An error occurred while trying to truncate the table '%@'. MySQL said: %@
fr: Une erreur s'est produite en essayant de tronquer la table '%1$@'. MySQL a dit: %2$@

source: An error occurred whilst trying to perform the operation. MySQL said: %@
fr: Une erreur s'est produite en essayant d'effectuer l'opération. MySQL a dit: %@

source: Resource Limits are not supported for your version of MySQL. Any Resouce Limits you specified have been discarded and not saved. MySQL said: %@
fr: Les limites de ressources ne sont pas prises en charge pour votre version de MySQL. Toutes les limites de récupération que vous avez spécifiées ont été rejetées et non sauvegardées. MySQL a dit: %@

source: An unhandled error occurred when attempting to create %lu of the export files. Please check the details and try again.
fr: Une erreur non gérée s'est produite en tentant de créer %lu des fichiers d'exportation. Veuillez vérifier les détails et réessayer.

source: An unhandled error occurred when attempting to create each of the export files. Please check the details and try again.
fr: Une erreur non gérée s'est produite lors de la création de chacun des fichiers d'exportation. Veuillez vérifier les détails et réessayer.

source: An unhandled error occurred when attempting to create the export file. Please check the details and try again.
fr: Une erreur non gérée s'est produite lors de la création du fichier d'exportation. Veuillez vérifier les détails et réessayer.

source: Analyze %@
fr: Analyser %@

source: Analyze Selected Items
fr: Analyser les éléments sélectionnés

source: Analyze Table
fr: Analyser la table

source: Analyze table failed.
fr: L'analyse de la table a échoué.

source: Are you sure you want to change this table's type to %@? Please be aware that changing a table's type has the potential to cause the loss of some or all of its data. This action cannot be undone.
fr: Êtes-vous sûr de vouloir changer le type de cette table en %@? Veuillez noter que le changement de type d'une table peut entraîner la perte d'une partie ou de la totalité de ses données. Cette action ne peut être annulée.

source: Are you sure you want to clear the global history list? This action cannot be undone.
fr: Êtes-vous sûr de vouloir effacer la liste de l'historique global ? Cette action est irréversible.

source: Are you sure you want to clear the history list for %@? This action cannot be undone.
fr: Êtes-vous sûr de vouloir effacer l'historique pour %@? Cette action ne peut pas être annulée.

source: Are you sure you want to delete ALL records in the selected tables? This operation cannot be undone.
fr: Êtes-vous sûr de vouloir supprimer TOUS les enregistrements des tables sélectionnées ? Cette opération ne peut pas être annulée.

source: Are you sure you want to delete ALL records in the table '%@'? This operation cannot be undone.
fr: Êtes-vous sûr de vouloir supprimer TOUS les enregistrements de la table '%@' ? Cette opération ne peut pas être annulée.

source: Are you sure you want to delete all the rows from this table? This action cannot be undone.
fr: Êtes-vous sûr de vouloir supprimer toutes les lignes de cette table ? Cette action ne peut pas être annulée.

source: Are you sure you want to delete the %@ '%@'? This operation cannot be undone.
fr: Êtes-vous sûr de vouloir supprimer la %1$@ '%2$@'? Cette opération ne peut pas être annulée.

source: Are you sure you want to delete the database '%@'? This operation cannot be undone.
fr: Êtes-vous sûr de vouloir supprimer la base de données '%@' ? Cette opération ne peut pas être annulée.

source: Are you sure you want to delete the favorite '%@'? This operation cannot be undone.
fr: Êtes-vous sûr de vouloir supprimer le favori '%@' ? Cette opération ne peut pas être annulée.

source: Are you sure you want to delete the field '%@'? This action cannot be undone.
fr: Êtes-vous sûr de vouloir supprimer le champ '%@' ? Cette action ne peut pas être annulée.

source: Are you sure you want to delete the group '%@'? All groups and favorites within this group will also be deleted. This operation cannot be undone.
fr: Êtes-vous sûr de vouloir supprimer le groupe '%@' ? Tous les groupes et les favoris de ce groupe seront également supprimés. Cette opération ne peut être annulée.

source: Are you sure you want to delete the index '%@'? This action cannot be undone.
fr: Êtes-vous sûr de vouloir supprimer l'index '%@' ? Cette action ne peut pas être annulée.

source: Are you sure you want to delete the selected %@? This operation cannot be undone.
fr: Êtes-vous sûr de vouloir supprimer la sélection %@? Cette opération ne peut pas être annulée.

source: Are you sure you want to delete the selected %ld rows from this table? This action cannot be undone.
fr: Êtes-vous sûr de vouloir supprimer les lignes %ld sélectionnées de cette table? Cette action ne peut pas être annulée.

source: Are you sure you want to delete the selected relations? This action cannot be undone.
fr: Êtes-vous sûr de vouloir supprimer les relations sélectionnées ? Cette action ne peut pas être annulée.

source: Are you sure you want to delete the selected row from this table? This action cannot be undone.
fr: Êtes-vous sûr de vouloir supprimer la ligne sélectionnée de cette table? Cette action ne peut pas être annulée.

source: Are you sure you want to delete the selected triggers? This action cannot be undone.
fr: Êtes-vous sûr de vouloir supprimer les déclencheurs sélectionnés ? Cette action ne peut pas être annulée.

source: Are you sure you want to kill connection ID %lld? Please be aware that continuing to kill this connection may result in data corruption. Please proceed with caution.
fr: Êtes-vous sûr de vouloir tuer l'ID de connexion %lld? Veuillez noter que continuer à tuer cette connexion peut entraîner une corruption des données. S'il vous plaît, procédez avec prudence.

source: Are you sure you want to kill the current query executing on connection ID %lld? Please be aware that continuing to kill this query may result in data corruption. Please proceed with caution.
fr: Êtes-vous sûr de vouloir tuer la requête en cours exécutée sur l'ID de connexion %lld? Veuillez noter que continuer à tuer cette requête peut entraîner une corruption des données. S'il vous plaît, procédez avec prudence.

source: Are you sure you want to move the selected Bundle to the Trash and remove them respectively?
fr: Êtes-vous sûr de vouloir déplacer le lot sélectionné dans la corbeille et les supprimer respectivement?

source: Are you sure you want to print the current content view of the table '%@'? It currently contains %@ rows, which may take a significant amount of time to print.
fr: Êtes-vous sûr de vouloir imprimer la vue de contenu actuelle de la table '%1$@' ? Il contient actuellement des rangées %2$@ , ce qui peut prendre beaucoup de temps à imprimer.

source: Are you sure you want to remove all of your saved query favorites? This action cannot be undone.
fr: Êtes-vous sûr de vouloir supprimer tous vos favoris de requête enregistrés ? Cette action ne peut pas être annulée.

source: Are you sure you want to remove all selected content filters? This action cannot be undone.
fr: Êtes-vous sûr de vouloir supprimer tous les filtres de contenu sélectionnés ? Cette action ne peut pas être annulée.

source: Are you sure you want to remove all selected query favorites? This action cannot be undone.
fr: Êtes-vous sûr de vouloir supprimer tous les favoris de la requête sélectionnée ? Cette action ne peut pas être annulée.

source: auto_increment: %@
fr: auto_incrément: %@

source: Autodetect
fr: Détection automatique

source: Background
fr: Arrière-plan

source: Backtick Quote
fr: Citation en arrière tick

source: BASH Error
fr: Erreur BASH

source: Browse & Edit Table Content
fr: Parcourir et éditer le contenu de la table

source: build
fr: construire

source: Build
fr: Construire

source: Bundle Editor
fr: Éditeur de lots

source: Bundle Error
fr: Erreur de bundle

source: Bundles in category %@
fr: Bundles dans la catégorie %@

source: Bundles Installation Error
fr: Erreur d'installation des paquets

source: bzip2 compression
fr: Compression bzip2

source: Can store a single spatial value of types POINT, LINESTRING or POLYGON. Spatial support in MySQL is based on the OpenGIS Geometry Model.
fr: Vous pouvez stocker une seule valeur spatiale de type POINT, LINESTRING ou POLYGON.

source: Cancel
fr: Annuler

source: Cancel Import
fr: Annuler l'import

source: Cancelling...
fr: Annulation en cours...

source: Cannot save an empty query.
fr: Impossible d'enregistrer une requête vide.

source: Caret
fr: Carets

source: Change
fr: Changement

source: Change Focus to Table List
fr: Passer la mise au point à la liste des tables

source: Change table type
fr: Changer le type de table

source: Changes have been made, which will be lost if this window is closed. Are you sure you want to continue
fr: Des modifications ont été faites, qui seront perdues si cette fenêtre est fermée. Êtes-vous sûr de vouloir continuer

source: Close the app?
fr: Fermer l'application ?

source: Are you sure you want to quit the app?
fr: Êtes-vous certain de vouloir fermer l'application ?

source: character set client: %@
fr: jeu de caractères client: %@

source: Check %@
fr: Vérifier %@

source: Check of all selected items successfully passed.
fr: Vérification de tous les éléments sélectionnés réussie.

source: check option: %@
fr: option de vérification : %@

source: Check Selected Items
fr: Vérifier les éléments sélectionnés

source: Check Table
fr: Vérification de la table

source: Check table failed.
fr: La vérification de la table a échoué.

source: Check table successfully passed.
fr: La table a été vérifiée avec succès.

source: Check View
fr: Vérifier la vue

source: Checking field data for editing...
fr: Vérification des données du champ pour l'édition...

source: Checksum %@
fr: Somme de contrôle %@

source: Checksum Selected Items
fr: Eléments sélectionnés de la somme de contrôle

source: Checksum Table
fr: Table de somme de contrôle

source: Checksums of %@
fr: Sommes de contrôle %@

source: Choose Database...
fr: Choisir la base de données...

source: Cleaning up...
fr: Nettoyage en cours...

source: Clear
fr: Nettoyer

source: Clear Console
fr: Effacer la console

source: Clear Global History
fr: Effacer l'historique global

source: Clear History for %@
fr: Effacer l'historique pour %@

source: Clear History?
fr: Effacer l'historique ?

source: Clear the console which shows all MySQL commands performed by Sequel Ace
fr: Effacer la console qui affiche toutes les commandes MySQL exécutées par Séquel Ace

source: Clear the document-based history list
fr: Vider la liste de l'historique basée sur le document

source: Clear the global history list
fr: Effacer la liste de l'historique global

source: Close
fr: Fermer

source: Close Tab
fr: Fermer l'onglet

source: Close Window
fr: Fermer la fenêtre

source: Collation
fr: Regroupement

source: collation connection: %@
fr: connexion au collationnement : %@

source: Comment
fr: Commenter

source: Comment Line
fr: Ligne de commentaire

source: Comment Selection
fr: Commenter la sélection

source: Connect
fr: Connecter

source: Connect via socket
fr: Se connecter via le socket

source: Connected
fr: Connecté

source: Connected to %@
fr: Connecté à %@

source: Connected to host, but unable to connect to database %@. Be sure that the database exists and that you have the necessary privileges. MySQL said: %@
fr: Connecté à l'hôte, mais impossible de se connecter à la base de données %1$@. Assurez-vous que la base de données existe et que vous avez les privilèges nécessaires. MySQL a dit: %2$@

source: Connecting...
fr: Connexion en cours...

source: Connecting…
fr: Connexion à…

source: Connection data file couldn't be read.
fr: Le fichier de données de connexion n'a pas pu être lu.

source: Connection data file %@ couldn't be read. Please try to save the document under a different name.
fr: Le fichier de données de connexion %@ n'a pas pu être lu. Veuillez essayer d'enregistrer le document sous un nom différent.

source: Connection failed!
fr: Échec de la connexion !

source: Connection file is encrypted
fr: Le fichier de connexion est chiffré

source: Connection succeeded
fr: Connexion réussie

source: ConsoleLog
fr: Journal de la console

source: Content
fr: Contenus

source: Content Filter clause is empty.
fr: La clause de filtre de contenu est vide.

source: Continue
fr: Continuer

source: Continue to print?
fr: Continuer à imprimer ?

source: Copy as RTF
fr: Copier en tant que RTF

source: Copy Create Function Syntax
fr: Copier la syntaxe de création de fonction

source: Copy Create Procedure Syntax
fr: Copier la syntaxe de création d'acte

source: Copy Create Syntaxes
fr: Copier la création de syntaxes

source: Copy Create Table Syntax
fr: Copier Créer une syntaxe de table

source: Copy Create View Syntax
fr: Copier la syntaxe de la vue

source: Copy Variable Name
fr: Copier le nom de la variable

source: Copy Variable Names
fr: Copier les noms des variables

source: Copy Variable Value
fr: Copier la valeur variable

source: Copy Variable Values
fr: Copier les valeurs des variables

source: Could not export the %@ '%@' because of a permissions error.
fr: Impossible d'exporter la %1$@ '%2$@' à cause d'une erreur de permission.

source: Could not parse file as CSV
fr: Impossible d'analyser le fichier comme CSV

source: Could not select database
fr: Impossible de sélectionner la base de données

source: Couldn't alter database. MySQL said: %@
fr: Impossible de modifier la base de données. MySQL a dit: %@

source: Couldn't copy default themes to Application Support Theme folder! Error: %@
fr: Impossible de copier les thèmes par défaut dans le dossier du thème de prise en charge de l'application! Erreur: %@

source: Couldn't create '%@'. MySQL said: %@
fr: Impossible de créer '%1$@'. MySQL a dit: %2$@

source: Couldn't create Application Support Bundle folder! Error: %@
fr: Impossible de créer le dossier Bundle de prise en charge de l'application! Erreur: %@

source: Couldn't create Application Support Theme folder! Error: %@
fr: Impossible de créer le dossier du thème de prise en charge de l'application ! Erreur: %@

source: Couldn't create database. MySQL said: %@
fr: Impossible de créer la base de données. MySQL a dit: %@

source: Couldn't delete '%@'. MySQL said: %@
fr: Impossible de supprimer '%1$@'. MySQL a dit: %2$@

source: Couldn't delete '%@'. Selecting the 'Force delete' option may prevent this issue, but may leave the database in an inconsistent state. MySQL said: %@
fr: Impossible de supprimer '%1$@'. La sélection de l'option 'Forcer la suppression' peut empêcher ce problème, mais peut laisser la base de données dans un état incohérent. MySQL a dit: %2$@

source: Couldn't delete field %@. MySQL said: %@
fr: Impossible de supprimer le champ %1$@. MySQL a dit: %2$@

source: Couldn't delete rows. MySQL said: %@
fr: Impossible de supprimer les lignes. MySQL a dit: %@

source: Couldn't delete the database. MySQL said: %@
fr: Impossible de supprimer la base de données. MySQL a dit: %@

source: Couldn't duplicate '%@'. MySQL said: %@
fr: Impossible de dupliquer '%1$@'. MySQL a dit: %2$@

source: Couldn't flush privileges. MySQL said: %@
fr: Impossible de vider les privilèges. MySQL a dit: %@

source: Couldn't get create syntax. MySQL said: %@
fr: Impossible d'obtenir la syntaxe. MySQL a dit: %@

source: Couldn't identify field origin unambiguously. The column '%@' contains data from more than one table.
fr: Impossible d'identifier l'origine du champ sans ambiguïté. La colonne '%@' contient des données provenant de plus d'une table.

source: Couldn't load the row. Reload the table to be sure that the row exists and use a primary key for your table.
fr: Impossible de charger la ligne. Rechargez la table pour être sûr que la ligne existe et utilisez une clé primaire pour votre table.

source: Couldn't read the file content of
fr: Impossible de lire le contenu du fichier de

source: Couldn't sort column.
fr: Impossible de trier la colonne.

source: Couldn't sort table. MySQL said: %@
fr: Impossible de trier la table. MySQL a dit: %@

source: Couldn't write field. MySQL said: %@
fr: Impossible d'écrire le champ. MySQL a dit: %@

source: Create syntax for
fr: Créer une syntaxe pour

source: Create syntax for %@ '%@'
fr: Créer une syntaxe pour %1$@ '%2$@ ' '

source: Create syntaxes for selected items
fr: Créer des syntaxes pour les éléments sélectionnés

source: created: %@
fr: créé: %@

source: Creates a surface by combining one LinearRing (ie. a LineString that is closed and simple) as the outside boundary with zero or more inner LinearRings acting as "holes".
fr: Crée une surface en combinant un anneau linéaire (c.-à-d. une Chaîne linéaire qui est fermée et simple) comme la frontière extérieure avec zéro ou plus d'anneaux linéaires internes agissant comme "trous".

source: Creating %@...
fr: Création de %@...

source: Current Line
fr: Ligne actuelle

source: Current Query
fr: Requête actuelle

source: CURRENT SELECTION
fr: SÉLECTION ACTUELLE

source: Current Word
fr: Mot actuel

source: Custom SSH binary enabled. Disable in Preferences to rule out incompatibilities!
fr: binaire SSH personnalisé activé. Désactivez dans les préférences pour exclure les incompatibilités!

source: Customize Filename (%@)
fr: Personnaliser le nom du fichier (%@)

source: data access: %@ (%@)
fr: accès aux données : %1$@ (%2$@)

source: Data Table
fr: Tableau de données

source: Data Table Scope commands will run on the Content and Query data tables
fr: Les commandes de tableau de données s'exécuteront sur les tables de données Contenu et Requête

source: Database
fr: Base de données

source: Database changed
fr: Base de données modifiée

source: Database must have a name.
fr: La base de données doit avoir un nom.

source: Database Rename Unsupported
fr: Renommer la base de données non prise en charge

source: Day
fr: Jour

source: Default
fr: Par défaut

source: Default (%@)
fr: Par défaut (%@)

source: Default Bundles Update
fr: Mise à jour des packs par défaut

source: Default: %@
fr: Par défaut: %@

source: default_value
fr: valeur par défaut

source: Definer
fr: Défini

source: definer: %@
fr: définir: %@

source: Defines a list of members, of which every field can use at most one. Values are sorted by their index number (starting at 0 for the first member).
fr: Définit une liste de membres, dont chaque champ peut être utilisé au plus un. Les valeurs sont triées par leur numéro d'index (à partir de 0 pour le premier membre).

source: Delete
fr: Supprimer

source: Delete %@ '%@'?
fr: Supprimer %1$@ '%2$@ ' ?

source: Delete Both
fr: Supprimer les deux

source: Delete database '%@'?
fr: Supprimer la base de données '%@ ' ?

source: Delete favorite '%@'?
fr: Supprimer le favori '%@ ' ?

source: Delete field '%@'?
fr: Supprimer le champ '%@ ' ?

source: Delete Function
fr: Supprimer la fonction

source: Delete Functions
fr: Supprimer les fonctions

source: Delete group '%@'?
fr: Supprimer le groupe '%@ ' ?

source: Delete index '%@'?
fr: Supprimer l'index%@'?

source: Delete Items
fr: Supprimer les éléments

source: Delete Procedure
fr: Supprimer la procédure

source: Delete Procedures
fr: Supprimer les Actes

source: Delete Relation
fr: Supprimer la relation

source: Delete relation
fr: Supprimer la relation

source: Delete Relations
fr: Supprimer les relations

source: Delete Row
fr: Supprimer la ligne

source: Delete Rows
fr: Supprimer les lignes

source: Delete rows?
fr: Supprimer les lignes ?

source: Delete selected %@?
fr: Supprimer la sélection %@?

source: Delete selected row?
fr: Supprimer la ligne sélectionnée ?

source: Delete Table...
fr: Supprimer la table...

source: Delete Tables
fr: Supprimer les tables

source: Delete Trigger
fr: Supprimer le déclencheur

source: Delete trigger
fr: Supprimer le déclencheur

source: Delete Triggers
fr: Supprimer les déclencheurs

source: Delete View
fr: Supprimer la vue

source: Delete Views
fr: Supprimer les vues

source: Disabled Cipher Suites
fr: Suites de chiffrement désactivées

source: Disables foreign key checks (FOREIGN_KEY_CHECKS) before deletion and re-enables them afterwards.
fr: Désactive les vérifications de clés étrangères (FOREIGN_KEY_CHECKS) avant la suppression et les réactive ensuite.

source: Discard changes
fr: Annuler les modifications

source: Disconnected from %@
fr: Déconnecté de %@

source: Do UPDATE where field contents match
fr: MISE À JOUR où le contenu du champ correspond

source: Do you really want to load a SQL file with %@ of data into the Query Editor?
fr: Voulez-vous vraiment charger un fichier SQL avec %@ de données dans l'éditeur de requête ?

source: Do you really want to proceed with %@ of data?
fr: Voulez-vous vraiment continuer avec %@ de données ?

source: Do you really want to shutdown the server?
fr: Voulez-vous vraiment éteindre le serveur?

source: DTD Identifier
fr: Identificateur DTD

source: Dump of table
fr: Dump de la table

source: Dump of view
fr: Extrait de la vue

source: Dumping...
fr: Dump en cours...

source: Duplicate %@ '%@' to:
fr: Dupliquer %1$@ '%2$@' à :

source: Duplicate Function...
fr: Dupliquer la fonction...

source: Duplicate Host
fr: Hôte en double

source: Duplicate Procedure...
fr: Procédure en double...

source: Duplicate Table...
fr: Dupliquer la table...

source: Duplicate User
fr: Dupliquer l'utilisateur

source: Duplicate View...
fr: Dupliquer la vue...

source: Duplicating the database '%@' is only partially supported as it contains objects other than tables (i.e. views, procedures, functions, etc.), which will not be copied. Would you like to continue?
fr: La duplication de la base de données '%@' n'est que partiellement supportée car elle contient des objets autres que les tables (i.e. vues, procédures, fonctions, etc.), qui ne seront pas copiées. Voulez-vous continuer ?

source: Edit Filters…
fr: Modifier les filtres…

source: Edit row
fr: Editer la ligne

source: Edit Table Structure
fr: Modifier la structure de la table

source: Edit Theme List…
fr: Modifier la liste des thèmes…

source: Edit user-defined Filters…
fr: Editer les filtres prédéfinis…

source: Empty query
fr: Requête vide

source: en
fr: fr

source: Encoding
fr: Encodage

source: encoding: %1$@
fr: encodage : %1$@

source: encoding: %1$@ (%2$@)
fr: encodage : %1$@ (%2$@)

source: engine: %@
fr: moteur: %@
